NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* CLOCK_XO_RUN: Indicates that XOSTART task was triggered */
  #define CLOCK_XO_RUN_ResetValue (0x00000000UL)     /*!< Reset value of RUN register.                                         */

/* STATUS @Bit 0 : XOSTART task triggered or not */
  #define CLOCK_XO_RUN_STATUS_Pos (0UL)              /*!< Position of STATUS field.                                            */
  #define CLOCK_XO_RUN_STATUS_Msk (0x1UL << CLOCK_XO_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.                            */
  #define CLOCK_XO_RUN_STATUS_Min (0x0UL)            /*!< Min enumerator value of STATUS field.                                */
  #define CLOCK_XO_RUN_STATUS_Max (0x1UL)            /*!< Max enumerator value of STATUS field.                                */
  #define CLOCK_XO_RUN_STATUS_NotTriggered (0x0UL)   /*!< Task not triggered                                                   */
  #define CLOCK_XO_RUN_STATUS_Triggered (0x1UL)      /*!< Task triggered                                                       */


/* CLOCK_XO_STAT: XO status */
  #define CLOCK_XO_STAT_ResetValue (0x00000000UL)    /*!< Reset value of STAT register.                                        */

/* STATE @Bit 16 : XO state (Running between START task and STOPPED event) */
  #define CLOCK_XO_STAT_STATE_Pos (16UL)             /*!< Position of STATE field.                                             */
  #define CLOCK_XO_STAT_STATE_Msk (0x1UL << CLOCK_XO_STAT_STATE_Pos) /*!< Bit mask of STATE field.                             */
  #define CLOCK_XO_STAT_STATE_Min (0x0UL)            /*!< Min enumerator value of STATE field.                                 */
  #define CLOCK_XO_STAT_STATE_Max (0x1UL)            /*!< Max enumerator value of STATE field.                                 */
  #define CLOCK_XO_STAT_STATE_NotRunning (0x0UL)     /*!< XO is not running                                                    */
  #define CLOCK_XO_STAT_STATE_Running (0x1UL)        /*!< XO is running                                                        */



/* ==================================================== Struct CLOCK_PLL ===================================================== */
/**
  * @brief PLL [CLOCK_PLL] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IM  uint32_t  RUN;                               /*!< (@ 0x00000008) Indicates that PLLSTART task was triggered            */
  __IM  uint32_t  STAT;                              /*!< (@ 0x0000000C) Which PLL settings were selected when triggering START
                                                                         task*/
} NRF_CLOCK_PLL_Type;                                /*!< Size = 16 (0x010)                                                    */

/* CLOCK_PLL_RUN: Indicates that PLLSTART task was triggered */
  #define CLOCK_PLL_RUN_ResetValue (0x00000000UL)    /*!< Reset value of RUN register.                                         */

/* STATUS @Bit 0 : PLLSTART task triggered or not */
  #define CLOCK_PLL_RUN_STATUS_Pos (0UL)             /*!< Position of STATUS field.                                            */
  #define CLOCK_PLL_RUN_STATUS_Msk (0x1UL << CLOCK_PLL_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.                          */
  #define CLOCK_PLL_RUN_STATUS_Min (0x0UL)           /*!< Min enumerator value of STATUS field.                                */
  #define CLOCK_PLL_RUN_STATUS_Max (0x1UL)           /*!< Max enumerator value of STATUS field.                                */
  #define CLOCK_PLL_RUN_STATUS_NotTriggered (0x0UL)  /*!< Task not triggered                                                   */
  #define CLOCK_PLL_RUN_STATUS_Triggered (0x1UL)     /*!< Task triggered                                                       */


/* CLOCK_PLL_STAT: Which PLL settings were selected when triggering START task */
  #define CLOCK_PLL_STAT_ResetValue (0x00000000UL)   /*!< Reset value of STAT register.                                        */

/* STATE @Bit 16 : PLL state (Running between START task and STOPPED event) */
  #define CLOCK_PLL_STAT_STATE_Pos (16UL)            /*!< Position of STATE field.                                             */
  #define CLOCK_PLL_STAT_STATE_Msk (0x1UL << CLOCK_PLL_STAT_STATE_Pos) /*!< Bit mask of STATE field.                           */
  #define CLOCK_PLL_STAT_STATE_Min (0x0UL)           /*!< Min enumerator value of STATE field.                                 */
  #define CLOCK_PLL_STAT_STATE_Max (0x1UL)           /*!< Max enumerator value of STATE field.                                 */
  #define CLOCK_PLL_STAT_STATE_NotRunning (0x0UL)    /*!< PLL is not running                                                   */
  #define CLOCK_PLL_STAT_STATE_Running (0x1UL)       /*!< PLL is running                                                       */



/* =================================================== Struct CLOCK_LFCLK ==================================================== */
/**
  * @brief LFCLK [CLOCK_LFCLK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SRC;                               /*!< (@ 0x00000000) Clock source for LFCLK                                */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  RUN;                               /*!< (@ 0x00000008) Indicates that LFCLKSTART task was triggered          */
  __IM  uint32_t  STAT;                              /*!< (@ 0x0000000C) Copy of LFCLK.SRCCOPY register, set when LFCLKSTARTED
                                                                         event is triggered.*/
  __IOM uint32_t  SRCCOPY;                           /*!< (@ 0x00000010) Copy of LFCLK.SRC register, set when LFCLKSTART task is
                                                                         triggered*/
} NRF_CLOCK_LFCLK_Type;                              /*!< Size = 20 (0x014)                                                    */

/* CLOCK_LFCLK_SRC: Clock source for LFCLK */
  #define CLOCK_LFCLK_SRC_ResetValue (0x00000000UL)  /*!< Reset value of SRC register.                                         */

/* SRC @Bits 0..1 : Select which LFCLK source is started by the LFCLKSTART task */
  #define CLOCK_LFCLK_SRC_SRC_Pos (0UL)              /*!< Position of SRC field.                                               */
  #define CLOCK_LFCLK_SRC_SRC_Msk (0x3UL << CLOCK_LFCLK_SRC_SRC_Pos) /*!< Bit mask of SRC field.                               */
  #define CLOCK_LFCLK_SRC_SRC_Min (0x0UL)            /*!< Min enumerator value of SRC field.                                   */
  #define CLOCK_LFCLK_SRC_SRC_Max (0x2UL)            /*!< Max enumerator value of SRC field.                                   */
  #define CLOCK_LFCLK_SRC_SRC_LFRC (0x0UL)           /*!< 32.768 kHz RC oscillator                                             */
  #define CLOCK_LFCLK_SRC_SRC_LFXO (0x1UL)           /*!< 32.768 kHz crystal oscillator                                        */
  #define CLOCK_LFCLK_SRC_SRC_LFSYNT (0x2UL)         /*!< 32.768 kHz synthesized from HFCLK                                    */


