NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* TASKS_XOSTART @Bit 0 : Start crystal oscillator (HFXO) */
  #define CLOCK_TASKS_XOSTART_TASKS_XOSTART_Pos (0UL) /*!< Position of TASKS_XOSTART field.                                    */
  #define CLOCK_TASKS_XOSTART_TASKS_XOSTART_Msk (0x1UL << CLOCK_TASKS_XOSTART_TASKS_XOSTART_Pos) /*!< Bit mask of TASKS_XOSTART
                                                                            field.*/
  #define CLOCK_TASKS_XOSTART_TASKS_XOSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_XOSTART field.                      */
  #define CLOCK_TASKS_XOSTART_TASKS_XOSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_XOSTART field.                      */
  #define CLOCK_TASKS_XOSTART_TASKS_XOSTART_Trigger (0x1UL) /*!< Trigger task                                                  */


/* CLOCK_TASKS_XOSTOP: Stop crystal oscillator (HFXO) */
  #define CLOCK_TASKS_XOSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XOSTOP register.                              */

/* TASKS_XOSTOP @Bit 0 : Stop crystal oscillator (HFXO) */
  #define CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Pos (0UL)  /*!< Position of TASKS_XOSTOP field.                                      */
  #define CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Msk (0x1UL << CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Pos) /*!< Bit mask of TASKS_XOSTOP
                                                                            field.*/
  #define CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_XOSTOP field.                         */
  #define CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_XOSTOP field.                         */
  #define CLOCK_TASKS_XOSTOP_TASKS_XOSTOP_Trigger (0x1UL) /*!< Trigger task                                                    */


/* CLOCK_TASKS_PLLSTART: Start PLL and keep it running, regardless of the automatic clock requests */
  #define CLOCK_TASKS_PLLSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PLLSTART register.                          */

/* TASKS_PLLSTART @Bit 0 : Start PLL and keep it running, regardless of the automatic clock requests */
  #define CLOCK_TASKS_PLLSTART_TASKS_PLLSTART_Pos (0UL) /*!< Position of TASKS_PLLSTART field.                                 */
  #define CLOCK_TASKS_PLLSTART_TASKS_PLLSTART_Msk (0x1UL << CLOCK_TASKS_PLLSTART_TASKS_PLLSTART_Pos) /*!< Bit mask of
                                                                            TASKS_PLLSTART field.*/
  #define CLOCK_TASKS_PLLSTART_TASKS_PLLSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_PLLSTART field.                   */
  #define CLOCK_TASKS_PLLSTART_TASKS_PLLSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_PLLSTART field.                   */
  #define CLOCK_TASKS_PLLSTART_TASKS_PLLSTART_Trigger (0x1UL) /*!< Trigger task                                                */


/* CLOCK_TASKS_PLLSTOP: Stop PLL */
  #define CLOCK_TASKS_PLLSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PLLSTOP register.                            */

/* TASKS_PLLSTOP @Bit 0 : Stop PLL */
  #define CLOCK_TASKS_PLLSTOP_TASKS_PLLSTOP_Pos (0UL) /*!< Position of TASKS_PLLSTOP field.                                    */
  #define CLOCK_TASKS_PLLSTOP_TASKS_PLLSTOP_Msk (0x1UL << CLOCK_TASKS_PLLSTOP_TASKS_PLLSTOP_Pos) /*!< Bit mask of TASKS_PLLSTOP
                                                                            field.*/
  #define CLOCK_TASKS_PLLSTOP_TASKS_PLLSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_PLLSTOP field.                      */
  #define CLOCK_TASKS_PLLSTOP_TASKS_PLLSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_PLLSTOP field.                      */
  #define CLOCK_TASKS_PLLSTOP_TASKS_PLLSTOP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* CLOCK_TASKS_LFCLKSTART: Start LFCLK source as selected in LFCLK.SRC */
  #define CLOCK_TASKS_LFCLKSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LFCLKSTART register.                      */

/* TASKS_LFCLKSTART @Bit 0 : Start LFCLK source as selected in LFCLK.SRC */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos (0UL) /*!< Position of TASKS_LFCLKSTART field.                           */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Msk (0x1UL << CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos) /*!< Bit mask of
                                                                            TASKS_LFCLKSTART field.*/
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_LFCLKSTART field.             */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_LFCLKSTART field.             */
  #define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger (0x1UL) /*!< Trigger task                                            */


/* CLOCK_TASKS_LFCLKSTOP: Stop LFCLK source */
  #define CLOCK_TASKS_LFCLKSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LFCLKSTOP register.                        */

/* TASKS_LFCLKSTOP @Bit 0 : Stop LFCLK source */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Pos (0UL) /*!< Position of TASKS_LFCLKSTOP field.                              */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Msk (0x1UL << CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_LFCLKSTOP field.*/
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_LFCLKSTOP field.                */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_LFCLKSTOP field.                */
  #define CLOCK_TASKS_LFCLKSTOP_TASKS_LFCLKSTOP_Trigger (0x1UL) /*!< Trigger task                                              */


/* CLOCK_TASKS_CAL: Start calibration of LFRC oscillator */
  #define CLOCK_TASKS_CAL_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_CAL register.                                   */

/* TASKS_CAL @Bit 0 : Start calibration of LFRC oscillator */
  #define CLOCK_TASKS_CAL_TASKS_CAL_Pos (0UL)        /*!< Position of TASKS_CAL field.                                         */
  #define CLOCK_TASKS_CAL_TASKS_CAL_Msk (0x1UL << CLOCK_TASKS_CAL_TASKS_CAL_Pos) /*!< Bit mask of TASKS_CAL field.             */
  #define CLOCK_TASKS_CAL_TASKS_CAL_Min (0x1UL)      /*!< Min enumerator value of TASKS_CAL field.                             */
  #define CLOCK_TASKS_CAL_TASKS_CAL_Max (0x1UL)      /*!< Max enumerator value of TASKS_CAL field.                             */
  #define CLOCK_TASKS_CAL_TASKS_CAL_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* CLOCK_TASKS_XOTUNE: Request tuning for HFXO */
  #define CLOCK_TASKS_XOTUNE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XOTUNE register.                              */

