NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* CPUC_LOCK: Register to lock the certain parts of the CPU from being modified. */
  #define CPUC_LOCK_ResetValue (0x00000000UL)        /*!< Reset value of LOCK register.                                        */

/* LOCKVTORAIRCRS @Bit 0 : Locks both the Vector table Offset Register (VTOR) and Application Interrupt and Reset Control
                           Register (AIRCR) for secure mode. */

  #define CPUC_LOCK_LOCKVTORAIRCRS_Pos (0UL)         /*!< Position of LOCKVTORAIRCRS field.                                    */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Msk (0x1UL << CPUC_LOCK_LOCKVTORAIRCRS_Pos) /*!< Bit mask of LOCKVTORAIRCRS field.          */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Min (0x0UL)       /*!< Min enumerator value of LOCKVTORAIRCRS field.                        */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Max (0x1UL)       /*!< Max enumerator value of LOCKVTORAIRCRS field.                        */
  #define CPUC_LOCK_LOCKVTORAIRCRS_NotLocked (0x0UL) /*!< Both VTOR and AIRCR can be changed.                                  */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Locked (0x1UL)    /*!< Prevents changes to both VTOR and AIRCR.                             */

/* LOCKVTORNS @Bit 1 : Locks the Vector table Offset Register (VTOR) for non-secure mode. */
  #define CPUC_LOCK_LOCKVTORNS_Pos (1UL)             /*!< Position of LOCKVTORNS field.                                        */
  #define CPUC_LOCK_LOCKVTORNS_Msk (0x1UL << CPUC_LOCK_LOCKVTORNS_Pos) /*!< Bit mask of LOCKVTORNS field.                      */
  #define CPUC_LOCK_LOCKVTORNS_Min (0x0UL)           /*!< Min enumerator value of LOCKVTORNS field.                            */
  #define CPUC_LOCK_LOCKVTORNS_Max (0x1UL)           /*!< Max enumerator value of LOCKVTORNS field.                            */
  #define CPUC_LOCK_LOCKVTORNS_NotLocked (0x0UL)     /*!< VTOR can be changed.                                                 */
  #define CPUC_LOCK_LOCKVTORNS_Locked (0x1UL)        /*!< Prevents changes to VTOR.                                            */

/* LOCKMPUS @Bit 2 : Locks the Memory Protection Unit (MPU) for secure mode. */
  #define CPUC_LOCK_LOCKMPUS_Pos (2UL)               /*!< Position of LOCKMPUS field.                                          */
  #define CPUC_LOCK_LOCKMPUS_Msk (0x1UL << CPUC_LOCK_LOCKMPUS_Pos) /*!< Bit mask of LOCKMPUS field.                            */
  #define CPUC_LOCK_LOCKMPUS_Min (0x0UL)             /*!< Min enumerator value of LOCKMPUS field.                              */
  #define CPUC_LOCK_LOCKMPUS_Max (0x1UL)             /*!< Max enumerator value of LOCKMPUS field.                              */
  #define CPUC_LOCK_LOCKMPUS_NotLocked (0x0UL)       /*!< MPU registers can be changed.                                        */
  #define CPUC_LOCK_LOCKMPUS_Locked (0x1UL)          /*!< Prevents changes to MPU registers.                                   */

/* LOCKMPUNS @Bit 3 : Locks the Memory Protection Unit (MPU) for non secure mode. */
  #define CPUC_LOCK_LOCKMPUNS_Pos (3UL)              /*!< Position of LOCKMPUNS field.                                         */
  #define CPUC_LOCK_LOCKMPUNS_Msk (0x1UL << CPUC_LOCK_LOCKMPUNS_Pos) /*!< Bit mask of LOCKMPUNS field.                         */
  #define CPUC_LOCK_LOCKMPUNS_Min (0x0UL)            /*!< Min enumerator value of LOCKMPUNS field.                             */
  #define CPUC_LOCK_LOCKMPUNS_Max (0x1UL)            /*!< Max enumerator value of LOCKMPUNS field.                             */
  #define CPUC_LOCK_LOCKMPUNS_NotLocked (0x0UL)      /*!< MPU registers can be changed.                                        */
  #define CPUC_LOCK_LOCKMPUNS_Locked (0x1UL)         /*!< Prevents changes to MPU registers.                                   */

/* LOCKSAU @Bit 4 : Locks the Security Attribution Unit (SAU) */
  #define CPUC_LOCK_LOCKSAU_Pos (4UL)                /*!< Position of LOCKSAU field.                                           */
  #define CPUC_LOCK_LOCKSAU_Msk (0x1UL << CPUC_LOCK_LOCKSAU_Pos) /*!< Bit mask of LOCKSAU field.                               */
  #define CPUC_LOCK_LOCKSAU_Min (0x0UL)              /*!< Min enumerator value of LOCKSAU field.                               */
  #define CPUC_LOCK_LOCKSAU_Max (0x1UL)              /*!< Max enumerator value of LOCKSAU field.                               */
  #define CPUC_LOCK_LOCKSAU_NotLocked (0x0UL)        /*!< SAU registers can be changed.                                        */
  #define CPUC_LOCK_LOCKSAU_Locked (0x1UL)           /*!< Prevents changes to SAU registers.                                   */


/* CPUC_CPUID: The identifier for the CPU in this subsystem. */
  #define CPUC_CPUID_ResetValue (0x00000000UL)       /*!< Reset value of CPUID register.                                       */

/* CPUID @Bits 0..31 : The CPU identifier. */
  #define CPUC_CPUID_CPUID_Pos (0UL)                 /*!< Position of CPUID field.                                             */
  #define CPUC_CPUID_CPUID_Msk (0xFFFFFFFFUL << CPUC_CPUID_CPUID_Pos) /*!< Bit mask of CPUID field.                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          CRACEN                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct CRACEN ====================================================== */
/**
  * @brief CRACEN TRNG
  */
  typedef struct {                                   /*!< CRACEN Structure                                                     */
    __IM uint32_t RESERVED[65];
    __IOM uint32_t EVENTS_RNG;                       /*!< (@ 0x00000104) Event indicating that interrupt triggered at RNG      */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable RNG peripheral module.                         */
  } NRF_CRACEN_Type;                                 /*!< Size = 1028 (0x404)                                                  */

/* CRACEN_EVENTS_RNG: Event indicating that interrupt triggered at RNG */
  #define CRACEN_EVENTS_RNG_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RNG register.                                 */

/* EVENTS_RNG @Bit 0 : Event indicating that interrupt triggered at RNG */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Pos (0UL)     /*!< Position of EVENTS_RNG field.                                        */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Msk (0x1UL << CRACEN_EVENTS_RNG_EVENTS_RNG_Pos) /*!< Bit mask of EVENTS_RNG field.      */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Min (0x0UL)   /*!< Min enumerator value of EVENTS_RNG field.                            */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Max (0x1UL)   /*!< Max enumerator value of EVENTS_RNG field.                            */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define CRACEN_EVENTS_RNG_EVENTS_RNG_Generated (0x1UL) /*!< Event generated                                                  */


/* CRACEN_INTEN: Enable or disable interrupt */
  #define CRACEN_INTEN_ResetValue (0x00000000UL)     /*!< Reset value of INTEN register.                                       */

/* RNG @Bit 1 : Enable or disable interrupt for event RNG */
  #define CRACEN_INTEN_RNG_Pos (1UL)                 /*!< Position of RNG field.                                               */
  #define CRACEN_INTEN_RNG_Msk (0x1UL << CRACEN_INTEN_RNG_Pos) /*!< Bit mask of RNG field.                                     */
  #define CRACEN_INTEN_RNG_Min (0x0UL)               /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTEN_RNG_Max (0x1UL)               /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTEN_RNG_Disabled (0x0UL)          /*!< Disable                                                              */
  #define CRACEN_INTEN_RNG_Enabled (0x1UL)           /*!< Enable                                                               */


