NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* CRACEN_INTENSET: Enable interrupt */
  #define CRACEN_INTENSET_ResetValue (0x00000000UL)  /*!< Reset value of INTENSET register.                                    */

/* RNG @Bit 1 : Write '1' to enable interrupt for event RNG */
  #define CRACEN_INTENSET_RNG_Pos (1UL)              /*!< Position of RNG field.                                               */
  #define CRACEN_INTENSET_RNG_Msk (0x1UL << CRACEN_INTENSET_RNG_Pos) /*!< Bit mask of RNG field.                               */
  #define CRACEN_INTENSET_RNG_Min (0x0UL)            /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTENSET_RNG_Max (0x1UL)            /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTENSET_RNG_Set (0x1UL)            /*!< Enable                                                               */
  #define CRACEN_INTENSET_RNG_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CRACEN_INTENSET_RNG_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* CRACEN_INTENCLR: Disable interrupt */
  #define CRACEN_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

/* RNG @Bit 1 : Write '1' to disable interrupt for event RNG */
  #define CRACEN_INTENCLR_RNG_Pos (1UL)              /*!< Position of RNG field.                                               */
  #define CRACEN_INTENCLR_RNG_Msk (0x1UL << CRACEN_INTENCLR_RNG_Pos) /*!< Bit mask of RNG field.                               */
  #define CRACEN_INTENCLR_RNG_Min (0x0UL)            /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Max (0x1UL)            /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Clear (0x1UL)          /*!< Disable                                                              */
  #define CRACEN_INTENCLR_RNG_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_RNG_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* CRACEN_INTPEND: Pending interrupts */
  #define CRACEN_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

/* RNG @Bit 1 : Read pending status of interrupt for event RNG */
  #define CRACEN_INTPEND_RNG_Pos (1UL)               /*!< Position of RNG field.                                               */
  #define CRACEN_INTPEND_RNG_Msk (0x1UL << CRACEN_INTPEND_RNG_Pos) /*!< Bit mask of RNG field.                                 */
  #define CRACEN_INTPEND_RNG_Min (0x0UL)             /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_Max (0x1UL)             /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_RNG_Pending (0x1UL)         /*!< Read: Pending                                                        */


/* CRACEN_ENABLE: Enable RNG peripheral module. */
  #define CRACEN_ENABLE_ResetValue (0x00000000UL)    /*!< Reset value of ENABLE register.                                      */

/* RNG @Bit 1 : Enable RNG */
  #define CRACEN_ENABLE_RNG_Pos (1UL)                /*!< Position of RNG field.                                               */
  #define CRACEN_ENABLE_RNG_Msk (0x1UL << CRACEN_ENABLE_RNG_Pos) /*!< Bit mask of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Min (0x0UL)              /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Max (0x1UL)              /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Disabled (0x0UL)         /*!< RNG disabled.                                                        */
  #define CRACEN_ENABLE_RNG_Enabled (0x1UL)          /*!< RNG enabled.                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CRACENCORE                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct CRACENCORE_RNGCONTROL =============================================== */
/**
  * @brief RNGCONTROL [CRACENCORE_RNGCONTROL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000000) Control register                                      */
  __IOM uint32_t  FIFOLEVEL;                         /*!< (@ 0x00000004) FIFO level register.                                  */
  __IOM uint32_t  FIFOTHRESHOLD;                     /*!< (@ 0x00000008) FIFO threshold register.                              */
  __IOM uint32_t  FIFODEPTH;                         /*!< (@ 0x0000000C) FIFO depth register.                                  */
  __IOM uint32_t  KEY[4];                            /*!< (@ 0x00000010) Key register.                                         */
  __IOM uint32_t  TESTDATA;                          /*!< (@ 0x00000020) Test data register.                                   */
  __IOM uint32_t  REPEATTHRESHOLD;                   /*!< (@ 0x00000024) Repetition test cut-off register.                     */
  __IOM uint32_t  PROPTESTCUTOFF;                    /*!< (@ 0x00000028) Proportion test cut-off register.                     */
  __IOM uint32_t  LFSRSEED;                          /*!< (@ 0x0000002C) LFSR seed register.                                   */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000030) Status register.                                      */
  __IOM uint32_t  WARMUPPERIOD;                      /*!< (@ 0x00000034) Number of clock cycles in warm-up sequence.           */
  __IOM uint32_t  DISABLEOSC;                        /*!< (@ 0x00000038) DisableOsc register.                                  */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  SAMPLINGPERIOD;                    /*!< (@ 0x00000044) Number of clock cycles between sampling moments.      */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  HWCONFIG;                          /*!< (@ 0x00000058) Hardware configuration register.                      */
  __IOM uint32_t  COOLDOWNPERIOD;                    /*!< (@ 0x0000005C) Number of clock cycles in cool-down sequence.         */
  __IOM uint32_t  AUTOCORRTESTCUTOFF0;               /*!< (@ 0x00000060) AutoCorrTestCutoff register 0                         */
  __IOM uint32_t  AUTOCORRTESTCUTOFF1;               /*!< (@ 0x00000064) AutoCorrTestCutoff register 1                         */
  __IOM uint32_t  CORRTESTCUTOFF0;                   /*!< (@ 0x00000068) CorrTestCutoff register 0                             */
  __IOM uint32_t  CORRTESTCUTOFF1;                   /*!< (@ 0x0000006C) CorrTestCutoff register 1                             */
  __IOM uint32_t  AUTOCORRTESTFAILED;                /*!< (@ 0x00000070) Auto-correlation test failing ring(s).                */
  __IOM uint32_t  CORRTESTFAILED;                    /*!< (@ 0x00000074) Correlation test failing ring.                        */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  HWVERSION;                         /*!< (@ 0x0000007C) Fixed to 1 for this version.                          */
  __IM  uint32_t  FIFO[32];                          /*!< (@ 0x00000080) FIFO data                                             */
} NRF_CRACENCORE_RNGCONTROL_Type;                    /*!< Size = 256 (0x100)                                                   */

/* CRACENCORE_RNGCONTROL_CONTROL: Control register */
  #define CRACENCORE_RNGCONTROL_CONTROL_ResetValue (0x00040000UL) /*!< Reset value of CONTROL register.                        */

