NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* REPFAIL @Bit 4 : NIST repetition test(s) failure. */
  #define CRACENCORE_RNGCONTROL_STATUS_REPFAIL_Pos (4UL) /*!< Position of REPFAIL field.                                       */
  #define CRACENCORE_RNGCONTROL_STATUS_REPFAIL_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_REPFAIL_Pos) /*!< Bit mask of REPFAIL
                                                                            field.*/

/* PROPFAIL @Bit 5 : NIST proportion test(s) failure. */
  #define CRACENCORE_RNGCONTROL_STATUS_PROPFAIL_Pos (5UL) /*!< Position of PROPFAIL field.                                     */
  #define CRACENCORE_RNGCONTROL_STATUS_PROPFAIL_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_PROPFAIL_Pos) /*!< Bit mask of
                                                                            PROPFAIL field.*/

/* ANYHEALTHTESTFAIL @Bit 6 : Any of the enabled health tests is failing. */
  #define CRACENCORE_RNGCONTROL_STATUS_ANYHEALTHTESTFAIL_Pos (6UL) /*!< Position of ANYHEALTHTESTFAIL field.                   */
  #define CRACENCORE_RNGCONTROL_STATUS_ANYHEALTHTESTFAIL_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_ANYHEALTHTESTFAIL_Pos) /*!<
                                                                            Bit mask of ANYHEALTHTESTFAIL field.*/

/* FULLINT @Bit 7 : FIFO full status. */
  #define CRACENCORE_RNGCONTROL_STATUS_FULLINT_Pos (7UL) /*!< Position of FULLINT field.                                       */
  #define CRACENCORE_RNGCONTROL_STATUS_FULLINT_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_FULLINT_Pos) /*!< Bit mask of FULLINT
                                                                            field.*/

/* STARTUPFAIL @Bit 10 : Start-up test(s) failure. */
  #define CRACENCORE_RNGCONTROL_STATUS_STARTUPFAIL_Pos (10UL) /*!< Position of STARTUPFAIL field.                              */
  #define CRACENCORE_RNGCONTROL_STATUS_STARTUPFAIL_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_STARTUPFAIL_Pos) /*!< Bit mask of
                                                                            STARTUPFAIL field.*/

/* REPTESTFAILPERSHARE @Bits 12..15 : NIST Repetition test failure per share. */
  #define CRACENCORE_RNGCONTROL_STATUS_REPTESTFAILPERSHARE_Pos (12UL) /*!< Position of REPTESTFAILPERSHARE field.              */
  #define CRACENCORE_RNGCONTROL_STATUS_REPTESTFAILPERSHARE_Msk (0xFUL << CRACENCORE_RNGCONTROL_STATUS_REPTESTFAILPERSHARE_Pos)
                                                                            /*!< Bit mask of REPTESTFAILPERSHARE field.*/

/* PROPTESTFAILPERSHARE @Bits 16..19 : NIST Proportion test failure per share. */
  #define CRACENCORE_RNGCONTROL_STATUS_PROPTESTFAILPERSHARE_Pos (16UL) /*!< Position of PROPTESTFAILPERSHARE field.            */
  #define CRACENCORE_RNGCONTROL_STATUS_PROPTESTFAILPERSHARE_Msk (0xFUL << CRACENCORE_RNGCONTROL_STATUS_PROPTESTFAILPERSHARE_Pos)
                                                                            /*!< Bit mask of PROPTESTFAILPERSHARE field.*/

/* CONDITIONINGISTOOSLOW @Bit 20 : Conditioning consumes data slower than they are provided to it. */
  #define CRACENCORE_RNGCONTROL_STATUS_CONDITIONINGISTOOSLOW_Pos (20UL) /*!< Position of CONDITIONINGISTOOSLOW field.          */
  #define CRACENCORE_RNGCONTROL_STATUS_CONDITIONINGISTOOSLOW_Msk (0x1UL << CRACENCORE_RNGCONTROL_STATUS_CONDITIONINGISTOOSLOW_Pos)
                                                                            /*!< Bit mask of CONDITIONINGISTOOSLOW field.*/


/* CRACENCORE_RNGCONTROL_WARMUPPERIOD: Number of clock cycles in warm-up sequence. */
  #define CRACENCORE_RNGCONTROL_WARMUPPERIOD_ResetValue (0x00000200UL) /*!< Reset value of WARMUPPERIOD register.              */

/* WARMUPPERIOD @Bits 0..11 : Number of clock cycles in warm-up sequence. */
  #define CRACENCORE_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Pos (0UL) /*!< Position of WARMUPPERIOD field.                       */
  #define CRACENCORE_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Msk (0xFFFUL << CRACENCORE_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Pos)
                                                                            /*!< Bit mask of WARMUPPERIOD field.*/
  #define CRACENCORE_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Min (0x000UL) /*!< Min value of WARMUPPERIOD field.                  */
  #define CRACENCORE_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Max (0xFFFUL) /*!< Max size of WARMUPPERIOD field.                   */
  #define CRACENCORE_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Recommended (0x200UL) /*!< Current recommended value. May change in
                                                                            future documentation releases without a hardware
                                                                            change.*/


/* CRACENCORE_RNGCONTROL_DISABLEOSC: DisableOsc register. */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_ResetValue (0x00000000UL) /*!< Reset value of DISABLEOSC register.                  */

/* DISABLEOSC @Bits 0..31 : Disable oscillator rings. */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Pos (0UL) /*!< Position of DISABLEOSC field.                             */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Msk (0xFFFFFFFFUL << CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Pos) /*!<
                                                                            Bit mask of DISABLEOSC field.*/
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Min (0x00000000UL) /*!< Min value of DISABLEOSC field.                   */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Max (0xFFFFFFFFUL) /*!< Max size of DISABLEOSC field.                    */
  #define CRACENCORE_RNGCONTROL_DISABLEOSC_DISABLEOSC_Recommended (0x00000000UL) /*!< Current recommended value. May change in
                                                                            future documentation releases without a hardware
                                                                            change.*/


/* CRACENCORE_RNGCONTROL_SAMPLINGPERIOD: Number of clock cycles between sampling moments. */
  #define CRACENCORE_RNGCONTROL_SAMPLINGPERIOD_ResetValue (0x00000FFFUL) /*!< Reset value of SAMPLINGPERIOD register.          */

