NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* FICR_INFO_UUID: 128-bit Universally Unique IDentifier (UUID). */
  #define FICR_INFO_UUID_MaxCount (4UL)              /*!< Max size of UUID[4] array.                                           */
  #define FICR_INFO_UUID_MaxIndex (3UL)              /*!< Max index of UUID[4] array.                                          */
  #define FICR_INFO_UUID_MinIndex (0UL)              /*!< Min index of UUID[4] array.                                          */
  #define FICR_INFO_UUID_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of UUID[4] register.                                     */

/* UUID @Bits 0..31 : Device UUID [n]. */
  #define FICR_INFO_UUID_UUID_Pos (0UL)              /*!< Position of UUID field.                                              */
  #define FICR_INFO_UUID_UUID_Msk (0xFFFFFFFFUL << FICR_INFO_UUID_UUID_Pos) /*!< Bit mask of UUID field.                       */


/* FICR_INFO_PART: Part code */
  #define FICR_INFO_PART_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of PART register.                                        */

/* PART @Bits 0..31 : Part code */
  #define FICR_INFO_PART_PART_Pos (0UL)              /*!< Position of PART field.                                              */
  #define FICR_INFO_PART_PART_Msk (0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos) /*!< Bit mask of PART field.                       */
  #define FICR_INFO_PART_PART_Min (0x054BE05AUL)     /*!< Min enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_N54LS05A (0x054BE05AUL) /*!< nRF54LS05A                                                          */
  #define FICR_INFO_PART_PART_N54LS05B (0x054BE05BUL) /*!< nRF54LS05B                                                          */
  #define FICR_INFO_PART_PART_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */


/* FICR_INFO_VARIANT: Function variant code, Hardware version code, and Production configuration code encoded as ASCII. */
  #define FICR_INFO_VARIANT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VARIANT register.                                    */

/* VARIANT @Bits 0..31 : Function variant code, Hardware version code, and Production configuration code encoded as ASCII */
  #define FICR_INFO_VARIANT_VARIANT_Pos (0UL)        /*!< Position of VARIANT field.                                           */
  #define FICR_INFO_VARIANT_VARIANT_Msk (0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos) /*!< Bit mask of VARIANT field.        */
  #define FICR_INFO_VARIANT_VARIANT_Min (0x41414230UL) /*!< Min enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_AAB0 (0x41414230UL) /*!< Example encoding for AAB0 - Function variant code AA, Hardware
                                                             version code B, Production configuration code 0*/
  #define FICR_INFO_VARIANT_VARIANT_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_PACKAGE: Package option */
  #define FICR_INFO_PACKAGE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PACKAGE register.                                    */

/* PACKAGE @Bits 0..31 : Package option */
  #define FICR_INFO_PACKAGE_PACKAGE_Pos (0UL)        /*!< Position of PACKAGE field.                                           */
  #define FICR_INFO_PACKAGE_PACKAGE_Msk (0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos) /*!< Bit mask of PACKAGE field.        */
  #define FICR_INFO_PACKAGE_PACKAGE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_RAM: RAM size (KB) */
  #define FICR_INFO_RAM_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of RAM register.                                         */

/* RAM @Bits 0..31 : RAM size (KB) */
  #define FICR_INFO_RAM_RAM_Pos (0UL)                /*!< Position of RAM field.                                               */
  #define FICR_INFO_RAM_RAM_Msk (0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos) /*!< Bit mask of RAM field.                            */
  #define FICR_INFO_RAM_RAM_Min (0x00000040UL)       /*!< Min enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_Max (0xFFFFFFFFUL)       /*!< Max enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_K96 (0x00000060UL)       /*!< 96 kByte RAM                                                         */
  #define FICR_INFO_RAM_RAM_K64 (0x00000040UL)       /*!< 64 kByte RAM                                                         */
  #define FICR_INFO_RAM_RAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                        */


/* FICR_INFO_RRAM: RRAM size (KB) */
  #define FICR_INFO_RRAM_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of RRAM register.                                        */

/* RRAM @Bits 0..31 : RRAM size (KB) */
  #define FICR_INFO_RRAM_RRAM_Pos (0UL)              /*!< Position of RRAM field.                                              */
  #define FICR_INFO_RRAM_RRAM_Msk (0xFFFFFFFFUL << FICR_INFO_RRAM_RRAM_Pos) /*!< Bit mask of RRAM field.                       */
  #define FICR_INFO_RRAM_RRAM_Min (0xFFFFFFFFUL)     /*!< Min enumerator value of RRAM field.                                  */
  #define FICR_INFO_RRAM_RRAM_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of RRAM field.                                  */
  #define FICR_INFO_RRAM_RRAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */



/* =================================================== Struct FICR_TRIMCNF =================================================== */
/**
  * @brief TRIMCNF [FICR_TRIMCNF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDR;                              /*!< (@ 0x00000000) Address of the register which will be written         */
  __IM  uint32_t  DATA;                              /*!< (@ 0x00000004) Data to be written into the register                  */
} NRF_FICR_TRIMCNF_Type;                             /*!< Size = 8 (0x008)                                                     */
