NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* DEVICEADDR @Bits 0..31 : 48 bit device address */
  #define FICR_DEVICEADDR_DEVICEADDR_Pos (0UL)       /*!< Position of DEVICEADDR field.                                        */
  #define FICR_DEVICEADDR_DEVICEADDR_Msk (0xFFFFFFFFUL << FICR_DEVICEADDR_DEVICEADDR_Pos) /*!< Bit mask of DEVICEADDR field.   */


/* FICR_XOSC32MTRIM: XOSC32M capacitor selection trim values */
  #define FICR_XOSC32MTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of XOSC32MTRIM register.                                 */

/* SLOPE @Bits 0..8 : Slope trim factor on twos complement form */
  #define FICR_XOSC32MTRIM_SLOPE_Pos (0UL)           /*!< Position of SLOPE field.                                             */
  #define FICR_XOSC32MTRIM_SLOPE_Msk (0x1FFUL << FICR_XOSC32MTRIM_SLOPE_Pos) /*!< Bit mask of SLOPE field.                     */

/* OFFSET @Bits 16..25 : Offset trim factor on integer form */
  #define FICR_XOSC32MTRIM_OFFSET_Pos (16UL)         /*!< Position of OFFSET field.                                            */
  #define FICR_XOSC32MTRIM_OFFSET_Msk (0x3FFUL << FICR_XOSC32MTRIM_OFFSET_Pos) /*!< Bit mask of OFFSET field.                  */


/* FICR_XOSC32KTRIM: XOSC32K capacitor selection trim values */
  #define FICR_XOSC32KTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of XOSC32KTRIM register.                                 */

/* SLOPE @Bits 0..8 : Slope trim factor on twos complement form */
  #define FICR_XOSC32KTRIM_SLOPE_Pos (0UL)           /*!< Position of SLOPE field.                                             */
  #define FICR_XOSC32KTRIM_SLOPE_Msk (0x1FFUL << FICR_XOSC32KTRIM_SLOPE_Pos) /*!< Bit mask of SLOPE field.                     */

/* OFFSET @Bits 16..25 : Offset trim factor on integer form */
  #define FICR_XOSC32KTRIM_OFFSET_Pos (16UL)         /*!< Position of OFFSET field.                                            */
  #define FICR_XOSC32KTRIM_OFFSET_Msk (0x3FFUL << FICR_XOSC32KTRIM_OFFSET_Pos) /*!< Bit mask of OFFSET field.                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct GPIO_PORTCNF =================================================== */
/**
  * @brief PORTCNF [GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  WEAKPU;                            /*!< (@ 0x00000000) Control global weak pull-ups on the selected set of
                                                                         GPIO pins*/
} NRF_GPIO_PORTCNF_Type;                             /*!< Size = 4 (0x004)                                                     */

/* GPIO_PORTCNF_WEAKPU: Control global weak pull-ups on the selected set of GPIO pins */
  #define GPIO_PORTCNF_WEAKPU_ResetValue (0x00000000UL) /*!< Reset value of WEAKPU register.                                   */

/* PULLUP @Bits 0..1 : Control pull-up. */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_Pos (0UL)       /*!< Position of PULLUP field.                                            */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_Msk (0x3UL << GPIO_PORTCNF_WEAKPU_PULLUP_Pos) /*!< Bit mask of PULLUP field.              */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_Min (0x0UL)     /*!< Min enumerator value of PULLUP field.                                */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_Max (0x3UL)     /*!< Max enumerator value of PULLUP field.                                */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_Disabled (0x0UL) /*!< Pull-up is disabled.                                                */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_PU0 (0x1UL)     /*!< Enable pull-up 0.                                                    */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_PU1 (0x2UL)     /*!< Enable pull-up 1.                                                    */
  #define GPIO_PORTCNF_WEAKPU_PULLUP_PU2 (0x3UL)     /*!< Enable pull-up 2.                                                    */


/* ======================================================= Struct GPIO ======================================================= */
/**
  * @brief GPIO Port
  */
  typedef struct {                                   /*!< GPIO Structure                                                       */
    __IOM uint32_t OUT;                              /*!< (@ 0x00000000) Write GPIO port                                       */
    __IOM uint32_t OUTSET;                           /*!< (@ 0x00000004) Set individual bits in GPIO port                      */
    __IOM uint32_t OUTCLR;                           /*!< (@ 0x00000008) Clear individual bits in GPIO port                    */
    __IM uint32_t IN;                                /*!< (@ 0x0000000C) Read GPIO port                                        */
    __IOM uint32_t DIR;                              /*!< (@ 0x00000010) Direction of GPIO pins                                */
    __IOM uint32_t DIRSET;                           /*!< (@ 0x00000014) DIR set register                                      */
    __IOM uint32_t DIRCLR;                           /*!< (@ 0x00000018) DIR clear register                                    */
    __IM uint32_t RESERVED;
    __IOM uint32_t LATCH;                            /*!< (@ 0x00000020) Latch register indicating what GPIO pins that have met
                                                                         the criteria set in the PIN_CNF[n].SENSE registers*/
    __IOM uint32_t DETECTMODE;                       /*!< (@ 0x00000024) Select between default DETECT signal behavior and
                                                                         LDETECT mode*/
    __IM uint32_t RESERVED1[2];
    __IOM NRF_GPIO_PORTCNF_Type PORTCNF;             /*!< (@ 0x00000030) (unspecified)                                         */
    __IM uint32_t RESERVED2[19];
    __IOM uint32_t PIN_CNF[32];                      /*!< (@ 0x00000080) Pin n configuration of GPIO pin                       */
  } NRF_GPIO_Type;                                   /*!< Size = 256 (0x100)                                                   */

/* GPIO_OUT: Write GPIO port */
  #define GPIO_OUT_ResetValue (0x00000000UL)         /*!< Reset value of OUT register.                                         */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUT_PIN0_Pos (0UL)                    /*!< Position of PIN0 field.                                              */
  #define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos) /*!< Bit mask of PIN0 field.                                          */
  #define GPIO_OUT_PIN0_Min (0x0UL)                  /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Max (0x1UL)                  /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN0_High (0x1UL)                 /*!< Pin driver is high                                                   */

