NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_IN_PIN18_Pos (18UL)                   /*!< Position of PIN18 field.                                             */
  #define GPIO_IN_PIN18_Msk (0x1UL << GPIO_IN_PIN18_Pos) /*!< Bit mask of PIN18 field.                                         */
  #define GPIO_IN_PIN18_Min (0x0UL)                  /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_IN_PIN18_Max (0x1UL)                  /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_IN_PIN18_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN18_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_IN_PIN19_Pos (19UL)                   /*!< Position of PIN19 field.                                             */
  #define GPIO_IN_PIN19_Msk (0x1UL << GPIO_IN_PIN19_Pos) /*!< Bit mask of PIN19 field.                                         */
  #define GPIO_IN_PIN19_Min (0x0UL)                  /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_IN_PIN19_Max (0x1UL)                  /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_IN_PIN19_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN19_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_IN_PIN20_Pos (20UL)                   /*!< Position of PIN20 field.                                             */
  #define GPIO_IN_PIN20_Msk (0x1UL << GPIO_IN_PIN20_Pos) /*!< Bit mask of PIN20 field.                                         */
  #define GPIO_IN_PIN20_Min (0x0UL)                  /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_IN_PIN20_Max (0x1UL)                  /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_IN_PIN20_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN20_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_IN_PIN21_Pos (21UL)                   /*!< Position of PIN21 field.                                             */
  #define GPIO_IN_PIN21_Msk (0x1UL << GPIO_IN_PIN21_Pos) /*!< Bit mask of PIN21 field.                                         */
  #define GPIO_IN_PIN21_Min (0x0UL)                  /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_IN_PIN21_Max (0x1UL)                  /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_IN_PIN21_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN21_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_IN_PIN22_Pos (22UL)                   /*!< Position of PIN22 field.                                             */
  #define GPIO_IN_PIN22_Msk (0x1UL << GPIO_IN_PIN22_Pos) /*!< Bit mask of PIN22 field.                                         */
  #define GPIO_IN_PIN22_Min (0x0UL)                  /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_IN_PIN22_Max (0x1UL)                  /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_IN_PIN22_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN22_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_IN_PIN23_Pos (23UL)                   /*!< Position of PIN23 field.                                             */
  #define GPIO_IN_PIN23_Msk (0x1UL << GPIO_IN_PIN23_Pos) /*!< Bit mask of PIN23 field.                                         */
  #define GPIO_IN_PIN23_Min (0x0UL)                  /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_IN_PIN23_Max (0x1UL)                  /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_IN_PIN23_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN23_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_IN_PIN24_Pos (24UL)                   /*!< Position of PIN24 field.                                             */
  #define GPIO_IN_PIN24_Msk (0x1UL << GPIO_IN_PIN24_Pos) /*!< Bit mask of PIN24 field.                                         */
  #define GPIO_IN_PIN24_Min (0x0UL)                  /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_IN_PIN24_Max (0x1UL)                  /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_IN_PIN24_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN24_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_IN_PIN25_Pos (25UL)                   /*!< Position of PIN25 field.                                             */
  #define GPIO_IN_PIN25_Msk (0x1UL << GPIO_IN_PIN25_Pos) /*!< Bit mask of PIN25 field.                                         */
  #define GPIO_IN_PIN25_Min (0x0UL)                  /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_IN_PIN25_Max (0x1UL)                  /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_IN_PIN25_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN25_High (0x1UL)                 /*!< Pin input is high                                                    */

