NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* GPIO_DIRSET: DIR set register */
  #define GPIO_DIRSET_ResetValue (0x00000000UL)      /*!< Reset value of DIRSET register.                                      */

/* PIN0 @Bit 0 : Set as output pin 0 */
  #define GPIO_DIRSET_PIN0_Pos (0UL)                 /*!< Position of PIN0 field.                                              */
  #define GPIO_DIRSET_PIN0_Msk (0x1UL << GPIO_DIRSET_PIN0_Pos) /*!< Bit mask of PIN0 field.                                    */
  #define GPIO_DIRSET_PIN0_Min (0x0UL)               /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_DIRSET_PIN0_Max (0x1UL)               /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_DIRSET_PIN0_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN0_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN0_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN1 @Bit 1 : Set as output pin 1 */
  #define GPIO_DIRSET_PIN1_Pos (1UL)                 /*!< Position of PIN1 field.                                              */
  #define GPIO_DIRSET_PIN1_Msk (0x1UL << GPIO_DIRSET_PIN1_Pos) /*!< Bit mask of PIN1 field.                                    */
  #define GPIO_DIRSET_PIN1_Min (0x0UL)               /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_DIRSET_PIN1_Max (0x1UL)               /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_DIRSET_PIN1_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN1_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN1_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN2 @Bit 2 : Set as output pin 2 */
  #define GPIO_DIRSET_PIN2_Pos (2UL)                 /*!< Position of PIN2 field.                                              */
  #define GPIO_DIRSET_PIN2_Msk (0x1UL << GPIO_DIRSET_PIN2_Pos) /*!< Bit mask of PIN2 field.                                    */
  #define GPIO_DIRSET_PIN2_Min (0x0UL)               /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_DIRSET_PIN2_Max (0x1UL)               /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_DIRSET_PIN2_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN2_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN2_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN3 @Bit 3 : Set as output pin 3 */
  #define GPIO_DIRSET_PIN3_Pos (3UL)                 /*!< Position of PIN3 field.                                              */
  #define GPIO_DIRSET_PIN3_Msk (0x1UL << GPIO_DIRSET_PIN3_Pos) /*!< Bit mask of PIN3 field.                                    */
  #define GPIO_DIRSET_PIN3_Min (0x0UL)               /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_DIRSET_PIN3_Max (0x1UL)               /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_DIRSET_PIN3_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN3_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN3_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN4 @Bit 4 : Set as output pin 4 */
  #define GPIO_DIRSET_PIN4_Pos (4UL)                 /*!< Position of PIN4 field.                                              */
  #define GPIO_DIRSET_PIN4_Msk (0x1UL << GPIO_DIRSET_PIN4_Pos) /*!< Bit mask of PIN4 field.                                    */
  #define GPIO_DIRSET_PIN4_Min (0x0UL)               /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_DIRSET_PIN4_Max (0x1UL)               /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_DIRSET_PIN4_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN4_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN4_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN5 @Bit 5 : Set as output pin 5 */
  #define GPIO_DIRSET_PIN5_Pos (5UL)                 /*!< Position of PIN5 field.                                              */
  #define GPIO_DIRSET_PIN5_Msk (0x1UL << GPIO_DIRSET_PIN5_Pos) /*!< Bit mask of PIN5 field.                                    */
  #define GPIO_DIRSET_PIN5_Min (0x0UL)               /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_DIRSET_PIN5_Max (0x1UL)               /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_DIRSET_PIN5_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN5_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN5_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN6 @Bit 6 : Set as output pin 6 */
  #define GPIO_DIRSET_PIN6_Pos (6UL)                 /*!< Position of PIN6 field.                                              */
  #define GPIO_DIRSET_PIN6_Msk (0x1UL << GPIO_DIRSET_PIN6_Pos) /*!< Bit mask of PIN6 field.                                    */
  #define GPIO_DIRSET_PIN6_Min (0x0UL)               /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_DIRSET_PIN6_Max (0x1UL)               /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_DIRSET_PIN6_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN6_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN6_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN7 @Bit 7 : Set as output pin 7 */
  #define GPIO_DIRSET_PIN7_Pos (7UL)                 /*!< Position of PIN7 field.                                              */
  #define GPIO_DIRSET_PIN7_Msk (0x1UL << GPIO_DIRSET_PIN7_Pos) /*!< Bit mask of PIN7 field.                                    */
  #define GPIO_DIRSET_PIN7_Min (0x0UL)               /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_DIRSET_PIN7_Max (0x1UL)               /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_DIRSET_PIN7_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN7_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN7_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN8 @Bit 8 : Set as output pin 8 */
  #define GPIO_DIRSET_PIN8_Pos (8UL)                 /*!< Position of PIN8 field.                                              */
  #define GPIO_DIRSET_PIN8_Msk (0x1UL << GPIO_DIRSET_PIN8_Pos) /*!< Bit mask of PIN8 field.                                    */
  #define GPIO_DIRSET_PIN8_Min (0x0UL)               /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_DIRSET_PIN8_Max (0x1UL)               /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_DIRSET_PIN8_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN8_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN8_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN9 @Bit 9 : Set as output pin 9 */
  #define GPIO_DIRSET_PIN9_Pos (9UL)                 /*!< Position of PIN9 field.                                              */
  #define GPIO_DIRSET_PIN9_Msk (0x1UL << GPIO_DIRSET_PIN9_Pos) /*!< Bit mask of PIN9 field.                                    */
  #define GPIO_DIRSET_PIN9_Min (0x0UL)               /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_DIRSET_PIN9_Max (0x1UL)               /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_DIRSET_PIN9_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN9_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN9_Set (0x1UL)               /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN10 @Bit 10 : Set as output pin 10 */
  #define GPIO_DIRSET_PIN10_Pos (10UL)               /*!< Position of PIN10 field.                                             */
  #define GPIO_DIRSET_PIN10_Msk (0x1UL << GPIO_DIRSET_PIN10_Pos) /*!< Bit mask of PIN10 field.                                 */
  #define GPIO_DIRSET_PIN10_Min (0x0UL)              /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_DIRSET_PIN10_Max (0x1UL)              /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_DIRSET_PIN10_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN10_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN10_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN11 @Bit 11 : Set as output pin 11 */
  #define GPIO_DIRSET_PIN11_Pos (11UL)               /*!< Position of PIN11 field.                                             */
  #define GPIO_DIRSET_PIN11_Msk (0x1UL << GPIO_DIRSET_PIN11_Pos) /*!< Bit mask of PIN11 field.                                 */
  #define GPIO_DIRSET_PIN11_Min (0x0UL)              /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_DIRSET_PIN11_Max (0x1UL)              /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_DIRSET_PIN11_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN11_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN11_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN12 @Bit 12 : Set as output pin 12 */
  #define GPIO_DIRSET_PIN12_Pos (12UL)               /*!< Position of PIN12 field.                                             */
  #define GPIO_DIRSET_PIN12_Msk (0x1UL << GPIO_DIRSET_PIN12_Pos) /*!< Bit mask of PIN12 field.                                 */
  #define GPIO_DIRSET_PIN12_Min (0x0UL)              /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_DIRSET_PIN12_Max (0x1UL)              /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_DIRSET_PIN12_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN12_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN12_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN13 @Bit 13 : Set as output pin 13 */
  #define GPIO_DIRSET_PIN13_Pos (13UL)               /*!< Position of PIN13 field.                                             */
  #define GPIO_DIRSET_PIN13_Msk (0x1UL << GPIO_DIRSET_PIN13_Pos) /*!< Bit mask of PIN13 field.                                 */
  #define GPIO_DIRSET_PIN13_Min (0x0UL)              /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_DIRSET_PIN13_Max (0x1UL)              /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_DIRSET_PIN13_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN13_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN13_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN14 @Bit 14 : Set as output pin 14 */
  #define GPIO_DIRSET_PIN14_Pos (14UL)               /*!< Position of PIN14 field.                                             */
  #define GPIO_DIRSET_PIN14_Msk (0x1UL << GPIO_DIRSET_PIN14_Pos) /*!< Bit mask of PIN14 field.                                 */
  #define GPIO_DIRSET_PIN14_Min (0x0UL)              /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_DIRSET_PIN14_Max (0x1UL)              /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_DIRSET_PIN14_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN14_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN14_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN15 @Bit 15 : Set as output pin 15 */
  #define GPIO_DIRSET_PIN15_Pos (15UL)               /*!< Position of PIN15 field.                                             */
  #define GPIO_DIRSET_PIN15_Msk (0x1UL << GPIO_DIRSET_PIN15_Pos) /*!< Bit mask of PIN15 field.                                 */
  #define GPIO_DIRSET_PIN15_Min (0x0UL)              /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_DIRSET_PIN15_Max (0x1UL)              /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_DIRSET_PIN15_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN15_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN15_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN16 @Bit 16 : Set as output pin 16 */
  #define GPIO_DIRSET_PIN16_Pos (16UL)               /*!< Position of PIN16 field.                                             */
  #define GPIO_DIRSET_PIN16_Msk (0x1UL << GPIO_DIRSET_PIN16_Pos) /*!< Bit mask of PIN16 field.                                 */
  #define GPIO_DIRSET_PIN16_Min (0x0UL)              /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_DIRSET_PIN16_Max (0x1UL)              /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_DIRSET_PIN16_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN16_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN16_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN17 @Bit 17 : Set as output pin 17 */
  #define GPIO_DIRSET_PIN17_Pos (17UL)               /*!< Position of PIN17 field.                                             */
  #define GPIO_DIRSET_PIN17_Msk (0x1UL << GPIO_DIRSET_PIN17_Pos) /*!< Bit mask of PIN17 field.                                 */
  #define GPIO_DIRSET_PIN17_Min (0x0UL)              /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_DIRSET_PIN17_Max (0x1UL)              /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_DIRSET_PIN17_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN17_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN17_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN18 @Bit 18 : Set as output pin 18 */
  #define GPIO_DIRSET_PIN18_Pos (18UL)               /*!< Position of PIN18 field.                                             */
  #define GPIO_DIRSET_PIN18_Msk (0x1UL << GPIO_DIRSET_PIN18_Pos) /*!< Bit mask of PIN18 field.                                 */
  #define GPIO_DIRSET_PIN18_Min (0x0UL)              /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_DIRSET_PIN18_Max (0x1UL)              /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_DIRSET_PIN18_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN18_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN18_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN19 @Bit 19 : Set as output pin 19 */
  #define GPIO_DIRSET_PIN19_Pos (19UL)               /*!< Position of PIN19 field.                                             */
  #define GPIO_DIRSET_PIN19_Msk (0x1UL << GPIO_DIRSET_PIN19_Pos) /*!< Bit mask of PIN19 field.                                 */
  #define GPIO_DIRSET_PIN19_Min (0x0UL)              /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_DIRSET_PIN19_Max (0x1UL)              /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_DIRSET_PIN19_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN19_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN19_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN20 @Bit 20 : Set as output pin 20 */
  #define GPIO_DIRSET_PIN20_Pos (20UL)               /*!< Position of PIN20 field.                                             */
  #define GPIO_DIRSET_PIN20_Msk (0x1UL << GPIO_DIRSET_PIN20_Pos) /*!< Bit mask of PIN20 field.                                 */
  #define GPIO_DIRSET_PIN20_Min (0x0UL)              /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_DIRSET_PIN20_Max (0x1UL)              /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_DIRSET_PIN20_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN20_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN20_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN21 @Bit 21 : Set as output pin 21 */
  #define GPIO_DIRSET_PIN21_Pos (21UL)               /*!< Position of PIN21 field.                                             */
  #define GPIO_DIRSET_PIN21_Msk (0x1UL << GPIO_DIRSET_PIN21_Pos) /*!< Bit mask of PIN21 field.                                 */
  #define GPIO_DIRSET_PIN21_Min (0x0UL)              /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_DIRSET_PIN21_Max (0x1UL)              /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_DIRSET_PIN21_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN21_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN21_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN22 @Bit 22 : Set as output pin 22 */
  #define GPIO_DIRSET_PIN22_Pos (22UL)               /*!< Position of PIN22 field.                                             */
  #define GPIO_DIRSET_PIN22_Msk (0x1UL << GPIO_DIRSET_PIN22_Pos) /*!< Bit mask of PIN22 field.                                 */
  #define GPIO_DIRSET_PIN22_Min (0x0UL)              /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_DIRSET_PIN22_Max (0x1UL)              /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_DIRSET_PIN22_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN22_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN22_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN23 @Bit 23 : Set as output pin 23 */
  #define GPIO_DIRSET_PIN23_Pos (23UL)               /*!< Position of PIN23 field.                                             */
  #define GPIO_DIRSET_PIN23_Msk (0x1UL << GPIO_DIRSET_PIN23_Pos) /*!< Bit mask of PIN23 field.                                 */
  #define GPIO_DIRSET_PIN23_Min (0x0UL)              /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_DIRSET_PIN23_Max (0x1UL)              /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_DIRSET_PIN23_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN23_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN23_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN24 @Bit 24 : Set as output pin 24 */
  #define GPIO_DIRSET_PIN24_Pos (24UL)               /*!< Position of PIN24 field.                                             */
  #define GPIO_DIRSET_PIN24_Msk (0x1UL << GPIO_DIRSET_PIN24_Pos) /*!< Bit mask of PIN24 field.                                 */
  #define GPIO_DIRSET_PIN24_Min (0x0UL)              /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_DIRSET_PIN24_Max (0x1UL)              /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_DIRSET_PIN24_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN24_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN24_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

