NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* PIN28 @Bit 28 : Set as input pin 28 */
  #define GPIO_DIRCLR_PIN28_Pos (28UL)               /*!< Position of PIN28 field.                                             */
  #define GPIO_DIRCLR_PIN28_Msk (0x1UL << GPIO_DIRCLR_PIN28_Pos) /*!< Bit mask of PIN28 field.                                 */
  #define GPIO_DIRCLR_PIN28_Min (0x0UL)              /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_DIRCLR_PIN28_Max (0x1UL)              /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_DIRCLR_PIN28_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN28_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN28_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN29 @Bit 29 : Set as input pin 29 */
  #define GPIO_DIRCLR_PIN29_Pos (29UL)               /*!< Position of PIN29 field.                                             */
  #define GPIO_DIRCLR_PIN29_Msk (0x1UL << GPIO_DIRCLR_PIN29_Pos) /*!< Bit mask of PIN29 field.                                 */
  #define GPIO_DIRCLR_PIN29_Min (0x0UL)              /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_DIRCLR_PIN29_Max (0x1UL)              /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_DIRCLR_PIN29_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN29_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN29_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN30 @Bit 30 : Set as input pin 30 */
  #define GPIO_DIRCLR_PIN30_Pos (30UL)               /*!< Position of PIN30 field.                                             */
  #define GPIO_DIRCLR_PIN30_Msk (0x1UL << GPIO_DIRCLR_PIN30_Pos) /*!< Bit mask of PIN30 field.                                 */
  #define GPIO_DIRCLR_PIN30_Min (0x0UL)              /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_DIRCLR_PIN30_Max (0x1UL)              /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_DIRCLR_PIN30_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN30_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN30_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN31 @Bit 31 : Set as input pin 31 */
  #define GPIO_DIRCLR_PIN31_Pos (31UL)               /*!< Position of PIN31 field.                                             */
  #define GPIO_DIRCLR_PIN31_Msk (0x1UL << GPIO_DIRCLR_PIN31_Pos) /*!< Bit mask of PIN31 field.                                 */
  #define GPIO_DIRCLR_PIN31_Min (0x0UL)              /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_DIRCLR_PIN31_Max (0x1UL)              /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_DIRCLR_PIN31_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN31_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN31_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */


/* GPIO_LATCH: Latch register indicating what GPIO pins that have met the criteria set in the PIN_CNF[n].SENSE registers */
  #define GPIO_LATCH_ResetValue (0x00000000UL)       /*!< Reset value of LATCH register.                                       */

/* PIN0 @Bit 0 : Status on whether PIN0 has met criteria set in PIN_CNF[0].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN0_Pos (0UL)                  /*!< Position of PIN0 field.                                              */
  #define GPIO_LATCH_PIN0_Msk (0x1UL << GPIO_LATCH_PIN0_Pos) /*!< Bit mask of PIN0 field.                                      */
  #define GPIO_LATCH_PIN0_Min (0x0UL)                /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_LATCH_PIN0_Max (0x1UL)                /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_LATCH_PIN0_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN0_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN1 @Bit 1 : Status on whether PIN1 has met criteria set in PIN_CNF[1].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN1_Pos (1UL)                  /*!< Position of PIN1 field.                                              */
  #define GPIO_LATCH_PIN1_Msk (0x1UL << GPIO_LATCH_PIN1_Pos) /*!< Bit mask of PIN1 field.                                      */
  #define GPIO_LATCH_PIN1_Min (0x0UL)                /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_LATCH_PIN1_Max (0x1UL)                /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_LATCH_PIN1_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN1_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN2 @Bit 2 : Status on whether PIN2 has met criteria set in PIN_CNF[2].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN2_Pos (2UL)                  /*!< Position of PIN2 field.                                              */
  #define GPIO_LATCH_PIN2_Msk (0x1UL << GPIO_LATCH_PIN2_Pos) /*!< Bit mask of PIN2 field.                                      */
  #define GPIO_LATCH_PIN2_Min (0x0UL)                /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_LATCH_PIN2_Max (0x1UL)                /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_LATCH_PIN2_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN2_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN3 @Bit 3 : Status on whether PIN3 has met criteria set in PIN_CNF[3].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN3_Pos (3UL)                  /*!< Position of PIN3 field.                                              */
  #define GPIO_LATCH_PIN3_Msk (0x1UL << GPIO_LATCH_PIN3_Pos) /*!< Bit mask of PIN3 field.                                      */
  #define GPIO_LATCH_PIN3_Min (0x0UL)                /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_LATCH_PIN3_Max (0x1UL)                /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_LATCH_PIN3_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN3_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN4 @Bit 4 : Status on whether PIN4 has met criteria set in PIN_CNF[4].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN4_Pos (4UL)                  /*!< Position of PIN4 field.                                              */
  #define GPIO_LATCH_PIN4_Msk (0x1UL << GPIO_LATCH_PIN4_Pos) /*!< Bit mask of PIN4 field.                                      */
  #define GPIO_LATCH_PIN4_Min (0x0UL)                /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_LATCH_PIN4_Max (0x1UL)                /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_LATCH_PIN4_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN4_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN5 @Bit 5 : Status on whether PIN5 has met criteria set in PIN_CNF[5].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN5_Pos (5UL)                  /*!< Position of PIN5 field.                                              */
  #define GPIO_LATCH_PIN5_Msk (0x1UL << GPIO_LATCH_PIN5_Pos) /*!< Bit mask of PIN5 field.                                      */
  #define GPIO_LATCH_PIN5_Min (0x0UL)                /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_LATCH_PIN5_Max (0x1UL)                /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_LATCH_PIN5_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN5_Latched (0x1UL)            /*!< Criteria has been met                                                */

