NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* POWER_INTENCLR: Disable interrupt */
  #define POWER_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* POFWARN @Bit 12 : Write '1' to disable interrupt for event POFWARN */
  #define POWER_INTENCLR_POFWARN_Pos (12UL)          /*!< Position of POFWARN field.                                           */
  #define POWER_INTENCLR_POFWARN_Msk (0x1UL << POWER_INTENCLR_POFWARN_Pos) /*!< Bit mask of POFWARN field.                     */
  #define POWER_INTENCLR_POFWARN_Min (0x0UL)         /*!< Min enumerator value of POFWARN field.                               */
  #define POWER_INTENCLR_POFWARN_Max (0x1UL)         /*!< Max enumerator value of POFWARN field.                               */
  #define POWER_INTENCLR_POFWARN_Clear (0x1UL)       /*!< Disable                                                              */
  #define POWER_INTENCLR_POFWARN_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define POWER_INTENCLR_POFWARN_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* SLEEPENTER @Bit 13 : Write '1' to disable interrupt for event SLEEPENTER */
  #define POWER_INTENCLR_SLEEPENTER_Pos (13UL)       /*!< Position of SLEEPENTER field.                                        */
  #define POWER_INTENCLR_SLEEPENTER_Msk (0x1UL << POWER_INTENCLR_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field.            */
  #define POWER_INTENCLR_SLEEPENTER_Min (0x0UL)      /*!< Min enumerator value of SLEEPENTER field.                            */
  #define POWER_INTENCLR_SLEEPENTER_Max (0x1UL)      /*!< Max enumerator value of SLEEPENTER field.                            */
  #define POWER_INTENCLR_SLEEPENTER_Clear (0x1UL)    /*!< Disable                                                              */
  #define POWER_INTENCLR_SLEEPENTER_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define POWER_INTENCLR_SLEEPENTER_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SLEEPEXIT @Bit 14 : Write '1' to disable interrupt for event SLEEPEXIT */
  #define POWER_INTENCLR_SLEEPEXIT_Pos (14UL)        /*!< Position of SLEEPEXIT field.                                         */
  #define POWER_INTENCLR_SLEEPEXIT_Msk (0x1UL << POWER_INTENCLR_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field.               */
  #define POWER_INTENCLR_SLEEPEXIT_Min (0x0UL)       /*!< Min enumerator value of SLEEPEXIT field.                             */
  #define POWER_INTENCLR_SLEEPEXIT_Max (0x1UL)       /*!< Max enumerator value of SLEEPEXIT field.                             */
  #define POWER_INTENCLR_SLEEPEXIT_Clear (0x1UL)     /*!< Disable                                                              */
  #define POWER_INTENCLR_SLEEPEXIT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define POWER_INTENCLR_SLEEPEXIT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* POWER_GPREGRET: General purpose retention register */
  #define POWER_GPREGRET_MaxCount (2UL)              /*!< Max size of GPREGRET[2] array.                                       */
  #define POWER_GPREGRET_MaxIndex (1UL)              /*!< Max index of GPREGRET[2] array.                                      */
  #define POWER_GPREGRET_MinIndex (0UL)              /*!< Min index of GPREGRET[2] array.                                      */
  #define POWER_GPREGRET_ResetValue (0x00000000UL)   /*!< Reset value of GPREGRET[2] register.                                 */

/* GPREGRET @Bits 0..7 : General purpose retention register */
  #define POWER_GPREGRET_GPREGRET_Pos (0UL)          /*!< Position of GPREGRET field.                                          */
  #define POWER_GPREGRET_GPREGRET_Msk (0xFFUL << POWER_GPREGRET_GPREGRET_Pos) /*!< Bit mask of GPREGRET field.                 */


/* POWER_CONSTLATSTAT: Status of constant latency */
  #define POWER_CONSTLATSTAT_ResetValue (0x00000000UL) /*!< Reset value of CONSTLATSTAT register.                              */

/* STATUS @Bit 0 : Status */
  #define POWER_CONSTLATSTAT_STATUS_Pos (0UL)        /*!< Position of STATUS field.                                            */
  #define POWER_CONSTLATSTAT_STATUS_Msk (0x1UL << POWER_CONSTLATSTAT_STATUS_Pos) /*!< Bit mask of STATUS field.                */
  #define POWER_CONSTLATSTAT_STATUS_Min (0x0UL)      /*!< Min enumerator value of STATUS field.                                */
  #define POWER_CONSTLATSTAT_STATUS_Max (0x1UL)      /*!< Max enumerator value of STATUS field.                                */
  #define POWER_CONSTLATSTAT_STATUS_Disable (0x0UL)  /*!< Constant latency disabled                                            */
  #define POWER_CONSTLATSTAT_STATUS_Enable (0x1UL)   /*!< Constant latency enabled                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PPIB                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PPIB_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [PPIB_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) The task overflow for SEND tasks using SUBSCRIBE_SEND.
                                                                         Write 0 to clear.*/
} NRF_PPIB_OVERFLOW_Type;                            /*!< Size = 4 (0x004)                                                     */

/* PPIB_OVERFLOW_SEND: The task overflow for SEND tasks using SUBSCRIBE_SEND. Write 0 to clear. */
  #define PPIB_OVERFLOW_SEND_ResetValue (0x00000000UL) /*!< Reset value of SEND register.                                      */

