NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* ACCOF @Bit 2 : Write '1' to disable interrupt for event ACCOF */
  #define QDEC_INTENCLR_ACCOF_Pos (2UL)              /*!< Position of ACCOF field.                                             */
  #define QDEC_INTENCLR_ACCOF_Msk (0x1UL << QDEC_INTENCLR_ACCOF_Pos) /*!< Bit mask of ACCOF field.                             */
  #define QDEC_INTENCLR_ACCOF_Min (0x0UL)            /*!< Min enumerator value of ACCOF field.                                 */
  #define QDEC_INTENCLR_ACCOF_Max (0x1UL)            /*!< Max enumerator value of ACCOF field.                                 */
  #define QDEC_INTENCLR_ACCOF_Clear (0x1UL)          /*!< Disable                                                              */
  #define QDEC_INTENCLR_ACCOF_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define QDEC_INTENCLR_ACCOF_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* DBLRDY @Bit 3 : Write '1' to disable interrupt for event DBLRDY */
  #define QDEC_INTENCLR_DBLRDY_Pos (3UL)             /*!< Position of DBLRDY field.                                            */
  #define QDEC_INTENCLR_DBLRDY_Msk (0x1UL << QDEC_INTENCLR_DBLRDY_Pos) /*!< Bit mask of DBLRDY field.                          */
  #define QDEC_INTENCLR_DBLRDY_Min (0x0UL)           /*!< Min enumerator value of DBLRDY field.                                */
  #define QDEC_INTENCLR_DBLRDY_Max (0x1UL)           /*!< Max enumerator value of DBLRDY field.                                */
  #define QDEC_INTENCLR_DBLRDY_Clear (0x1UL)         /*!< Disable                                                              */
  #define QDEC_INTENCLR_DBLRDY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define QDEC_INTENCLR_DBLRDY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 4 : Write '1' to disable interrupt for event STOPPED */
  #define QDEC_INTENCLR_STOPPED_Pos (4UL)            /*!< Position of STOPPED field.                                           */
  #define QDEC_INTENCLR_STOPPED_Msk (0x1UL << QDEC_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define QDEC_INTENCLR_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define QDEC_INTENCLR_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define QDEC_INTENCLR_STOPPED_Clear (0x1UL)        /*!< Disable                                                              */
  #define QDEC_INTENCLR_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define QDEC_INTENCLR_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* QDEC_ENABLE: Enable the quadrature decoder */
  #define QDEC_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable or disable the quadrature decoder */
  #define QDEC_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define QDEC_ENABLE_ENABLE_Msk (0x1UL << QDEC_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define QDEC_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define QDEC_ENABLE_ENABLE_Max (0x1UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define QDEC_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable                                                              */
  #define QDEC_ENABLE_ENABLE_Enabled (0x1UL)         /*!< Enable                                                               */


/* QDEC_LEDPOL: LED output pin polarity */
  #define QDEC_LEDPOL_ResetValue (0x00000000UL)      /*!< Reset value of LEDPOL register.                                      */

/* LEDPOL @Bit 0 : LED output pin polarity */
  #define QDEC_LEDPOL_LEDPOL_Pos (0UL)               /*!< Position of LEDPOL field.                                            */
  #define QDEC_LEDPOL_LEDPOL_Msk (0x1UL << QDEC_LEDPOL_LEDPOL_Pos) /*!< Bit mask of LEDPOL field.                              */
  #define QDEC_LEDPOL_LEDPOL_Min (0x0UL)             /*!< Min enumerator value of LEDPOL field.                                */
  #define QDEC_LEDPOL_LEDPOL_Max (0x1UL)             /*!< Max enumerator value of LEDPOL field.                                */
  #define QDEC_LEDPOL_LEDPOL_ActiveLow (0x0UL)       /*!< Led active on output pin low                                         */
  #define QDEC_LEDPOL_LEDPOL_ActiveHigh (0x1UL)      /*!< Led active on output pin high                                        */


/* QDEC_SAMPLEPER: Sample period */
  #define QDEC_SAMPLEPER_ResetValue (0x00000000UL)   /*!< Reset value of SAMPLEPER register.                                   */

/* SAMPLEPER @Bits 0..3 : Sample period. The SAMPLE register will be updated for every new sample */
  #define QDEC_SAMPLEPER_SAMPLEPER_Pos (0UL)         /*!< Position of SAMPLEPER field.                                         */
  #define QDEC_SAMPLEPER_SAMPLEPER_Msk (0xFUL << QDEC_SAMPLEPER_SAMPLEPER_Pos) /*!< Bit mask of SAMPLEPER field.               */
  #define QDEC_SAMPLEPER_SAMPLEPER_Min (0x0UL)       /*!< Min enumerator value of SAMPLEPER field.                             */
  #define QDEC_SAMPLEPER_SAMPLEPER_Max (0xAUL)       /*!< Max enumerator value of SAMPLEPER field.                             */
  #define QDEC_SAMPLEPER_SAMPLEPER_128us (0x0UL)     /*!< 128 us                                                               */
  #define QDEC_SAMPLEPER_SAMPLEPER_256us (0x1UL)     /*!< 256 us                                                               */
  #define QDEC_SAMPLEPER_SAMPLEPER_512us (0x2UL)     /*!< 512 us                                                               */
  #define QDEC_SAMPLEPER_SAMPLEPER_1024us (0x3UL)    /*!< 1024 us                                                              */
  #define QDEC_SAMPLEPER_SAMPLEPER_2048us (0x4UL)    /*!< 2048 us                                                              */
  #define QDEC_SAMPLEPER_SAMPLEPER_4096us (0x5UL)    /*!< 4096 us                                                              */
  #define QDEC_SAMPLEPER_SAMPLEPER_8192us (0x6UL)    /*!< 8192 us                                                              */
  #define QDEC_SAMPLEPER_SAMPLEPER_16384us (0x7UL)   /*!< 16384 us                                                             */
  #define QDEC_SAMPLEPER_SAMPLEPER_32ms (0x8UL)      /*!< 32768 us                                                             */
  #define QDEC_SAMPLEPER_SAMPLEPER_65ms (0x9UL)      /*!< 65536 us                                                             */
  #define QDEC_SAMPLEPER_SAMPLEPER_131ms (0xAUL)     /*!< 131072 us                                                            */


