NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* ACCDBL @Bits 0..3 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
  #define QDEC_ACCDBL_ACCDBL_Pos (0UL)               /*!< Position of ACCDBL field.                                            */
  #define QDEC_ACCDBL_ACCDBL_Msk (0xFUL << QDEC_ACCDBL_ACCDBL_Pos) /*!< Bit mask of ACCDBL field.                              */
  #define QDEC_ACCDBL_ACCDBL_Min (0x0UL)             /*!< Min value of ACCDBL field.                                           */
  #define QDEC_ACCDBL_ACCDBL_Max (0xFUL)             /*!< Max size of ACCDBL field.                                            */


/* QDEC_ACCDBLREAD: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */
  #define QDEC_ACCDBLREAD_ResetValue (0x00000000UL)  /*!< Reset value of ACCDBLREAD register.                                  */

/* ACCDBLREAD @Bits 0..3 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is
                           triggered. */

  #define QDEC_ACCDBLREAD_ACCDBLREAD_Pos (0UL)       /*!< Position of ACCDBLREAD field.                                        */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Msk (0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos) /*!< Bit mask of ACCDBLREAD field.          */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Min (0x0UL)     /*!< Min value of ACCDBLREAD field.                                       */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Max (0xFUL)     /*!< Max size of ACCDBLREAD field.                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct RADIO_RXGAIN =================================================== */
/**
  * @brief RXGAIN [RADIO_RXGAIN] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Override configuration of receiver gain control loop  */
} NRF_RADIO_RXGAIN_Type;                             /*!< Size = 8 (0x008)                                                     */

/* RADIO_RXGAIN_CONFIG: Override configuration of receiver gain control loop */
  #define RADIO_RXGAIN_CONFIG_ResetValue (0x801230C3UL) /*!< Reset value of CONFIG register.                                   */

/* AGCAAFOVERRIDE @Bits 17..20 : Override value for AAF */
  #define RADIO_RXGAIN_CONFIG_AGCAAFOVERRIDE_Pos (17UL) /*!< Position of AGCAAFOVERRIDE field.                                 */
  #define RADIO_RXGAIN_CONFIG_AGCAAFOVERRIDE_Msk (0xFUL << RADIO_RXGAIN_CONFIG_AGCAAFOVERRIDE_Pos) /*!< Bit mask of
                                                                            AGCAAFOVERRIDE field.*/

/* AGCMIXOVERRIDE @Bit 21 : Override value for MIX */
  #define RADIO_RXGAIN_CONFIG_AGCMIXOVERRIDE_Pos (21UL) /*!< Position of AGCMIXOVERRIDE field.                                 */
  #define RADIO_RXGAIN_CONFIG_AGCMIXOVERRIDE_Msk (0x1UL << RADIO_RXGAIN_CONFIG_AGCMIXOVERRIDE_Pos) /*!< Bit mask of
                                                                            AGCMIXOVERRIDE field.*/

/* AGCLNAOVERRIDE @Bits 22..23 : Override value for LNA */
  #define RADIO_RXGAIN_CONFIG_AGCLNAOVERRIDE_Pos (22UL) /*!< Position of AGCLNAOVERRIDE field.                                 */
  #define RADIO_RXGAIN_CONFIG_AGCLNAOVERRIDE_Msk (0x3UL << RADIO_RXGAIN_CONFIG_AGCLNAOVERRIDE_Pos) /*!< Bit mask of
                                                                            AGCLNAOVERRIDE field.*/

/* AGCOVERRIDEGAIN @Bit 28 : Enable AGC override */
  #define RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_Pos (28UL) /*!< Position of AGCOVERRIDEGAIN field.                               */
  #define RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_Msk (0x1UL << RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_Pos) /*!< Bit mask of
                                                                            AGCOVERRIDEGAIN field.*/
  #define RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_Min (0x0UL) /*!< Min enumerator value of AGCOVERRIDEGAIN field.                  */
  #define RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_Max (0x1UL) /*!< Max enumerator value of AGCOVERRIDEGAIN field.                  */
  #define RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_NoOverride (0x0UL) /*!< AGC takes control over all gains                         */
  #define RADIO_RXGAIN_CONFIG_AGCOVERRIDEGAIN_Override (0x1UL) /*!< Manual control of AAF, MIX, and LNA gain settings          */


/* ====================================================== Struct RADIO ======================================================= */
/**
  * @brief 2.4 GHz radio
  */
  typedef struct {                                   /*!< RADIO Structure                                                      */
    __OM uint32_t TASKS_TXEN;                        /*!< (@ 0x00000000) Enable RADIO in TX mode                               */
    __OM uint32_t TASKS_RXEN;                        /*!< (@ 0x00000004) Enable RADIO in RX mode                               */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000008) Start RADIO                                           */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x0000000C) Stop RADIO                                            */
    __OM uint32_t TASKS_DISABLE;                     /*!< (@ 0x00000010) Disable RADIO                                         */
    __OM uint32_t TASKS_RSSISTART;                   /*!< (@ 0x00000014) Start the RSSI and take one single sample of the
                                                                         receive signal strength*/
    __OM uint32_t TASKS_BCSTART;                     /*!< (@ 0x00000018) Start the bit counter                                 */
    __OM uint32_t TASKS_BCSTOP;                      /*!< (@ 0x0000001C) Stop the bit counter                                  */
    __IM uint32_t RESERVED[19];
    __OM uint32_t TASKS_PLLEN;                       /*!< (@ 0x0000006C) Enable RADIO in PLL mode (standby for either TX or RX)*/
    __IM uint32_t RESERVED1[13];
    __OM uint32_t TASKS_SOFTRESET;                   /*!< (@ 0x000000A4) Reset all public registers, but with these exceptions:
                                                                         DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH
                                                                         registers. Only to be used in DISABLED state.*/
    __IM uint32_t RESERVED2[22];
    __IOM uint32_t SUBSCRIBE_TXEN;                   /*!< (@ 0x00000100) Subscribe configuration for task TXEN                 */
    __IOM uint32_t SUBSCRIBE_RXEN;                   /*!< (@ 0x00000104) Subscribe configuration for task RXEN                 */
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000108) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x0000010C) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_DISABLE;                /*!< (@ 0x00000110) Subscribe configuration for task DISABLE              */
    __IOM uint32_t SUBSCRIBE_RSSISTART;              /*!< (@ 0x00000114) Subscribe configuration for task RSSISTART            */
    __IOM uint32_t SUBSCRIBE_BCSTART;                /*!< (@ 0x00000118) Subscribe configuration for task BCSTART              */
    __IOM uint32_t SUBSCRIBE_BCSTOP;                 /*!< (@ 0x0000011C) Subscribe configuration for task BCSTOP               */
    __IM uint32_t RESERVED3[19];
    __IOM uint32_t SUBSCRIBE_PLLEN;                  /*!< (@ 0x0000016C) Subscribe configuration for task PLLEN                */
    __IM uint32_t RESERVED4[13];
    __IOM uint32_t SUBSCRIBE_SOFTRESET;              /*!< (@ 0x000001A4) Subscribe configuration for task SOFTRESET            */
    __IM uint32_t RESERVED5[22];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000200) RADIO has ramped up and is ready to be started        */
    __IOM uint32_t EVENTS_TXREADY;                   /*!< (@ 0x00000204) RADIO has ramped up and is ready to be started TX path*/
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000208) RADIO has ramped up and is ready to be started RX path*/
    __IOM uint32_t EVENTS_ADDRESS;                   /*!< (@ 0x0000020C) Address sent or received                              */
    __IM uint32_t RESERVED6;
    __IOM uint32_t EVENTS_PAYLOAD;                   /*!< (@ 0x00000214) Packet payload sent or received                       */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000218) Memory access for packet data has been completed      */
    __IOM uint32_t EVENTS_PHYEND;                    /*!< (@ 0x0000021C) The last bit is sent on air or last bit is received   */
    __IOM uint32_t EVENTS_DISABLED;                  /*!< (@ 0x00000220) RADIO has been disabled                               */
    __IOM uint32_t EVENTS_DEVMATCH;                  /*!< (@ 0x00000224) A device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_DEVMISS;                   /*!< (@ 0x00000228) No device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_CRCOK;                     /*!< (@ 0x0000022C) Packet received with CRC ok                           */
    __IOM uint32_t EVENTS_CRCERROR;                  /*!< (@ 0x00000230) Packet received with CRC error                        */
    __IM uint32_t RESERVED7;
    __IOM uint32_t EVENTS_BCMATCH;                   /*!< (@ 0x00000238) Bit counter reached bit count value                   */
    __IM uint32_t RESERVED8[7];
    __IOM uint32_t EVENTS_SYNC;                      /*!< (@ 0x00000258) Initial sync detected                                 */
    __IM uint32_t RESERVED9[21];
    __IOM uint32_t EVENTS_PLLREADY;                  /*!< (@ 0x000002B0) PLL has settled and RADIO is ready to be enabled in
                                                                         either TX or RX mode*/
    __IM uint32_t RESERVED10[2];
    __IOM uint32_t EVENTS_RXADDRESS;                 /*!< (@ 0x000002BC) Address received                                      */
    __IM uint32_t RESERVED11[16];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000300) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_TXREADY;                  /*!< (@ 0x00000304) Publish configuration for event TXREADY               */
    __IOM uint32_t PUBLISH_RXREADY;                  /*!< (@ 0x00000308) Publish configuration for event RXREADY               */
    __IOM uint32_t PUBLISH_ADDRESS;                  /*!< (@ 0x0000030C) Publish configuration for event ADDRESS               */
    __IM uint32_t RESERVED12;
    __IOM uint32_t PUBLISH_PAYLOAD;                  /*!< (@ 0x00000314) Publish configuration for event PAYLOAD               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000318) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_PHYEND;                   /*!< (@ 0x0000031C) Publish configuration for event PHYEND                */
    __IOM uint32_t PUBLISH_DISABLED;                 /*!< (@ 0x00000320) Publish configuration for event DISABLED              */
    __IOM uint32_t PUBLISH_DEVMATCH;                 /*!< (@ 0x00000324) Publish configuration for event DEVMATCH              */
    __IOM uint32_t PUBLISH_DEVMISS;                  /*!< (@ 0x00000328) Publish configuration for event DEVMISS               */
    __IOM uint32_t PUBLISH_CRCOK;                    /*!< (@ 0x0000032C) Publish configuration for event CRCOK                 */
    __IOM uint32_t PUBLISH_CRCERROR;                 /*!< (@ 0x00000330) Publish configuration for event CRCERROR              */
    __IM uint32_t RESERVED13;
    __IOM uint32_t PUBLISH_BCMATCH;                  /*!< (@ 0x00000338) Publish configuration for event BCMATCH               */
    __IM uint32_t RESERVED14[7];
    __IOM uint32_t PUBLISH_SYNC;                     /*!< (@ 0x00000358) Publish configuration for event SYNC                  */
    __IM uint32_t RESERVED15[21];
    __IOM uint32_t PUBLISH_PLLREADY;                 /*!< (@ 0x000003B0) Publish configuration for event PLLREADY              */
    __IM uint32_t RESERVED16[2];
    __IOM uint32_t PUBLISH_RXADDRESS;                /*!< (@ 0x000003BC) Publish configuration for event RXADDRESS             */
    __IM uint32_t RESERVED17[16];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000400) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED18[33];
    __IOM uint32_t INTENSET00;                       /*!< (@ 0x00000488) Enable interrupt                                      */
    __IOM uint32_t INTENSET01;                       /*!< (@ 0x0000048C) Enable interrupt                                      */
    __IOM uint32_t INTENCLR00;                       /*!< (@ 0x00000490) Disable interrupt                                     */
    __IOM uint32_t INTENCLR01;                       /*!< (@ 0x00000494) Disable interrupt                                     */
    __IM uint32_t RESERVED19[4];
    __IOM uint32_t INTENSET10;                       /*!< (@ 0x000004A8) Enable interrupt                                      */
    __IOM uint32_t INTENSET11;                       /*!< (@ 0x000004AC) Enable interrupt                                      */
    __IOM uint32_t INTENCLR10;                       /*!< (@ 0x000004B0) Disable interrupt                                     */
    __IOM uint32_t INTENCLR11;                       /*!< (@ 0x000004B4) Disable interrupt                                     */
    __IM uint32_t RESERVED20[18];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000500) Data rate and modulation                              */
    __IM uint32_t RESERVED21[5];
    __IOM uint32_t PHYENDTXDELAY;                    /*!< (@ 0x00000518) Configurable delay of PHYEND event for TX             */
    __IM uint32_t RESERVED22;
    __IM uint32_t STATE;                             /*!< (@ 0x00000520) Current radio state                                   */
    __IM uint32_t RESERVED23[7];
    __IOM uint32_t DATAWHITE;                        /*!< (@ 0x00000540) Data whitening configuration                          */
    __IM uint32_t RESERVED24[112];
    __IOM uint32_t TIMING;                           /*!< (@ 0x00000704) Timing                                                */
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000708) Frequency                                             */
    __IM uint32_t RESERVED25;
    __IOM uint32_t TXPOWER;                          /*!< (@ 0x00000710) Output power                                          */
    __IOM uint32_t TIFS;                             /*!< (@ 0x00000714) Interframe spacing in us                              */
    __IM uint32_t RSSISAMPLE;                        /*!< (@ 0x00000718) RSSI sample                                           */
    __IM uint32_t RESERVED26[45];
    __IOM NRF_RADIO_RXGAIN_Type RXGAIN;              /*!< (@ 0x000007D0) (unspecified)                                         */
    __IM uint32_t RESERVED27[11];
    __IOM uint32_t FREQFINETUNE;                     /*!< (@ 0x00000804) Fine tuning of the RF frequency                       */
    __IM uint32_t RESERVED28[64];
    __IOM uint32_t FECONFIG;                         /*!< (@ 0x00000908) Config register                                       */
    __IM uint32_t RESERVED29[125];
    __IM uint32_t CFO_STAT;                          /*!< (@ 0x00000B00) Carrier freq. offset estimate                         */
    __IM uint32_t RESERVED30[15];
    __IOM uint32_t DBCCORR;                          /*!< (@ 0x00000B40) Correlator thresholds                                 */
    __IM uint32_t RESERVED31[178];
    __IM uint32_t CRCSTATUS;                         /*!< (@ 0x00000E0C) CRC status                                            */
    __IM uint32_t RXMATCH;                           /*!< (@ 0x00000E10) Received address                                      */
    __IM uint32_t RXCRC;                             /*!< (@ 0x00000E14) CRC field of previously received packet               */
    __IM uint32_t DAI;                               /*!< (@ 0x00000E18) Device address match index                            */
    __IM uint32_t PDUSTAT;                           /*!< (@ 0x00000E1C) Payload status                                        */
    __IOM uint32_t PCNF0;                            /*!< (@ 0x00000E20) Packet configuration register 0                       */
    __IM uint32_t RESERVED32;
    __IOM uint32_t PCNF1;                            /*!< (@ 0x00000E28) Packet configuration register 1                       */
    __IOM uint32_t BASE0;                            /*!< (@ 0x00000E2C) Base address 0                                        */
    __IOM uint32_t BASE1;                            /*!< (@ 0x00000E30) Base address 1                                        */
    __IOM uint32_t PREFIX0;                          /*!< (@ 0x00000E34) Prefixes bytes for logical addresses 0-3              */
    __IOM uint32_t PREFIX1;                          /*!< (@ 0x00000E38) Prefixes bytes for logical addresses 4-7              */
    __IOM uint32_t TXADDRESS;                        /*!< (@ 0x00000E3C) Transmit address select                               */
    __IOM uint32_t RXADDRESSES;                      /*!< (@ 0x00000E40) Receive address select                                */
    __IOM uint32_t CRCCNF;                           /*!< (@ 0x00000E44) CRC configuration                                     */
    __IOM uint32_t CRCPOLY;                          /*!< (@ 0x00000E48) CRC polynomial                                        */
    __IOM uint32_t CRCINIT;                          /*!< (@ 0x00000E4C) CRC initial value                                     */
    __IOM uint32_t DAB[8];                           /*!< (@ 0x00000E50) Device address base segment n                         */
    __IOM uint32_t DAP[8];                           /*!< (@ 0x00000E70) Device address prefix n                               */
    __IOM uint32_t DACNF;                            /*!< (@ 0x00000E90) Device address match configuration                    */
    __IOM uint32_t BCC;                              /*!< (@ 0x00000E94) Bit counter compare                                   */
    __IM uint32_t RESERVED33[14];
    __IOM uint32_t PACKETPTR;                        /*!< (@ 0x00000ED0) Packet pointer                                        */
  } NRF_RADIO_Type;                                  /*!< Size = 3796 (0xED4)                                                  */

/* RADIO_TASKS_TXEN: Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TXEN register.                                  */

