NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* RADIO_INTENCLR01: Disable interrupt */
  #define RADIO_INTENCLR01_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR01 register.                                  */

/* PLLREADY @Bit 12 : Write '1' to disable interrupt for event PLLREADY */
  #define RADIO_INTENCLR01_PLLREADY_Pos (12UL)       /*!< Position of PLLREADY field.                                          */
  #define RADIO_INTENCLR01_PLLREADY_Msk (0x1UL << RADIO_INTENCLR01_PLLREADY_Pos) /*!< Bit mask of PLLREADY field.              */
  #define RADIO_INTENCLR01_PLLREADY_Min (0x0UL)      /*!< Min enumerator value of PLLREADY field.                              */
  #define RADIO_INTENCLR01_PLLREADY_Max (0x1UL)      /*!< Max enumerator value of PLLREADY field.                              */
  #define RADIO_INTENCLR01_PLLREADY_Clear (0x1UL)    /*!< Disable                                                              */
  #define RADIO_INTENCLR01_PLLREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR01_PLLREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to disable interrupt for event RXADDRESS */
  #define RADIO_INTENCLR01_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENCLR01_RXADDRESS_Msk (0x1UL << RADIO_INTENCLR01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENCLR01_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENCLR01_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENCLR01_RXADDRESS_Clear (0x1UL)   /*!< Disable                                                              */
  #define RADIO_INTENCLR01_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENCLR01_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* RADIO_INTENSET10: Enable interrupt */
  #define RADIO_INTENSET10_ResetValue (0x00000000UL) /*!< Reset value of INTENSET10 register.                                  */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define RADIO_INTENSET10_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define RADIO_INTENSET10_READY_Msk (0x1UL << RADIO_INTENSET10_READY_Pos) /*!< Bit mask of READY field.                       */
  #define RADIO_INTENSET10_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTENSET10_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTENSET10_READY_Set (0x1UL)         /*!< Enable                                                               */
  #define RADIO_INTENSET10_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TXREADY @Bit 1 : Write '1' to enable interrupt for event TXREADY */
  #define RADIO_INTENSET10_TXREADY_Pos (1UL)         /*!< Position of TXREADY field.                                           */
  #define RADIO_INTENSET10_TXREADY_Msk (0x1UL << RADIO_INTENSET10_TXREADY_Pos) /*!< Bit mask of TXREADY field.                 */
  #define RADIO_INTENSET10_TXREADY_Min (0x0UL)       /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTENSET10_TXREADY_Max (0x1UL)       /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTENSET10_TXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_TXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_TXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXREADY @Bit 2 : Write '1' to enable interrupt for event RXREADY */
  #define RADIO_INTENSET10_RXREADY_Pos (2UL)         /*!< Position of RXREADY field.                                           */
  #define RADIO_INTENSET10_RXREADY_Msk (0x1UL << RADIO_INTENSET10_RXREADY_Pos) /*!< Bit mask of RXREADY field.                 */
  #define RADIO_INTENSET10_RXREADY_Min (0x0UL)       /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTENSET10_RXREADY_Max (0x1UL)       /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTENSET10_RXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_RXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_RXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ADDRESS @Bit 3 : Write '1' to enable interrupt for event ADDRESS */
  #define RADIO_INTENSET10_ADDRESS_Pos (3UL)         /*!< Position of ADDRESS field.                                           */
  #define RADIO_INTENSET10_ADDRESS_Msk (0x1UL << RADIO_INTENSET10_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                 */
  #define RADIO_INTENSET10_ADDRESS_Min (0x0UL)       /*!< Min enumerator value of ADDRESS field.                               */
  #define RADIO_INTENSET10_ADDRESS_Max (0x1UL)       /*!< Max enumerator value of ADDRESS field.                               */
  #define RADIO_INTENSET10_ADDRESS_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_ADDRESS_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_ADDRESS_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PAYLOAD @Bit 5 : Write '1' to enable interrupt for event PAYLOAD */
  #define RADIO_INTENSET10_PAYLOAD_Pos (5UL)         /*!< Position of PAYLOAD field.                                           */
  #define RADIO_INTENSET10_PAYLOAD_Msk (0x1UL << RADIO_INTENSET10_PAYLOAD_Pos) /*!< Bit mask of PAYLOAD field.                 */
  #define RADIO_INTENSET10_PAYLOAD_Min (0x0UL)       /*!< Min enumerator value of PAYLOAD field.                               */
  #define RADIO_INTENSET10_PAYLOAD_Max (0x1UL)       /*!< Max enumerator value of PAYLOAD field.                               */
  #define RADIO_INTENSET10_PAYLOAD_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_PAYLOAD_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_PAYLOAD_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* END @Bit 6 : Write '1' to enable interrupt for event END */
  #define RADIO_INTENSET10_END_Pos (6UL)             /*!< Position of END field.                                               */
  #define RADIO_INTENSET10_END_Msk (0x1UL << RADIO_INTENSET10_END_Pos) /*!< Bit mask of END field.                             */
  #define RADIO_INTENSET10_END_Min (0x0UL)           /*!< Min enumerator value of END field.                                   */
  #define RADIO_INTENSET10_END_Max (0x1UL)           /*!< Max enumerator value of END field.                                   */
  #define RADIO_INTENSET10_END_Set (0x1UL)           /*!< Enable                                                               */
  #define RADIO_INTENSET10_END_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_END_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

