NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* PHYEND @Bit 7 : Write '1' to enable interrupt for event PHYEND */
  #define RADIO_INTENSET10_PHYEND_Pos (7UL)          /*!< Position of PHYEND field.                                            */
  #define RADIO_INTENSET10_PHYEND_Msk (0x1UL << RADIO_INTENSET10_PHYEND_Pos) /*!< Bit mask of PHYEND field.                    */
  #define RADIO_INTENSET10_PHYEND_Min (0x0UL)        /*!< Min enumerator value of PHYEND field.                                */
  #define RADIO_INTENSET10_PHYEND_Max (0x1UL)        /*!< Max enumerator value of PHYEND field.                                */
  #define RADIO_INTENSET10_PHYEND_Set (0x1UL)        /*!< Enable                                                               */
  #define RADIO_INTENSET10_PHYEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_PHYEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DISABLED @Bit 8 : Write '1' to enable interrupt for event DISABLED */
  #define RADIO_INTENSET10_DISABLED_Pos (8UL)        /*!< Position of DISABLED field.                                          */
  #define RADIO_INTENSET10_DISABLED_Msk (0x1UL << RADIO_INTENSET10_DISABLED_Pos) /*!< Bit mask of DISABLED field.              */
  #define RADIO_INTENSET10_DISABLED_Min (0x0UL)      /*!< Min enumerator value of DISABLED field.                              */
  #define RADIO_INTENSET10_DISABLED_Max (0x1UL)      /*!< Max enumerator value of DISABLED field.                              */
  #define RADIO_INTENSET10_DISABLED_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET10_DISABLED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_DISABLED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DEVMATCH @Bit 9 : Write '1' to enable interrupt for event DEVMATCH */
  #define RADIO_INTENSET10_DEVMATCH_Pos (9UL)        /*!< Position of DEVMATCH field.                                          */
  #define RADIO_INTENSET10_DEVMATCH_Msk (0x1UL << RADIO_INTENSET10_DEVMATCH_Pos) /*!< Bit mask of DEVMATCH field.              */
  #define RADIO_INTENSET10_DEVMATCH_Min (0x0UL)      /*!< Min enumerator value of DEVMATCH field.                              */
  #define RADIO_INTENSET10_DEVMATCH_Max (0x1UL)      /*!< Max enumerator value of DEVMATCH field.                              */
  #define RADIO_INTENSET10_DEVMATCH_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET10_DEVMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_DEVMATCH_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DEVMISS @Bit 10 : Write '1' to enable interrupt for event DEVMISS */
  #define RADIO_INTENSET10_DEVMISS_Pos (10UL)        /*!< Position of DEVMISS field.                                           */
  #define RADIO_INTENSET10_DEVMISS_Msk (0x1UL << RADIO_INTENSET10_DEVMISS_Pos) /*!< Bit mask of DEVMISS field.                 */
  #define RADIO_INTENSET10_DEVMISS_Min (0x0UL)       /*!< Min enumerator value of DEVMISS field.                               */
  #define RADIO_INTENSET10_DEVMISS_Max (0x1UL)       /*!< Max enumerator value of DEVMISS field.                               */
  #define RADIO_INTENSET10_DEVMISS_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_DEVMISS_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_DEVMISS_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CRCOK @Bit 11 : Write '1' to enable interrupt for event CRCOK */
  #define RADIO_INTENSET10_CRCOK_Pos (11UL)          /*!< Position of CRCOK field.                                             */
  #define RADIO_INTENSET10_CRCOK_Msk (0x1UL << RADIO_INTENSET10_CRCOK_Pos) /*!< Bit mask of CRCOK field.                       */
  #define RADIO_INTENSET10_CRCOK_Min (0x0UL)         /*!< Min enumerator value of CRCOK field.                                 */
  #define RADIO_INTENSET10_CRCOK_Max (0x1UL)         /*!< Max enumerator value of CRCOK field.                                 */
  #define RADIO_INTENSET10_CRCOK_Set (0x1UL)         /*!< Enable                                                               */
  #define RADIO_INTENSET10_CRCOK_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_CRCOK_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* CRCERROR @Bit 12 : Write '1' to enable interrupt for event CRCERROR */
  #define RADIO_INTENSET10_CRCERROR_Pos (12UL)       /*!< Position of CRCERROR field.                                          */
  #define RADIO_INTENSET10_CRCERROR_Msk (0x1UL << RADIO_INTENSET10_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.              */
  #define RADIO_INTENSET10_CRCERROR_Min (0x0UL)      /*!< Min enumerator value of CRCERROR field.                              */
  #define RADIO_INTENSET10_CRCERROR_Max (0x1UL)      /*!< Max enumerator value of CRCERROR field.                              */
  #define RADIO_INTENSET10_CRCERROR_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET10_CRCERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_CRCERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* BCMATCH @Bit 14 : Write '1' to enable interrupt for event BCMATCH */
  #define RADIO_INTENSET10_BCMATCH_Pos (14UL)        /*!< Position of BCMATCH field.                                           */
  #define RADIO_INTENSET10_BCMATCH_Msk (0x1UL << RADIO_INTENSET10_BCMATCH_Pos) /*!< Bit mask of BCMATCH field.                 */
  #define RADIO_INTENSET10_BCMATCH_Min (0x0UL)       /*!< Min enumerator value of BCMATCH field.                               */
  #define RADIO_INTENSET10_BCMATCH_Max (0x1UL)       /*!< Max enumerator value of BCMATCH field.                               */
  #define RADIO_INTENSET10_BCMATCH_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_BCMATCH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_BCMATCH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SYNC @Bit 22 : Write '1' to enable interrupt for event SYNC */
  #define RADIO_INTENSET10_SYNC_Pos (22UL)           /*!< Position of SYNC field.                                              */
  #define RADIO_INTENSET10_SYNC_Msk (0x1UL << RADIO_INTENSET10_SYNC_Pos) /*!< Bit mask of SYNC field.                          */
  #define RADIO_INTENSET10_SYNC_Min (0x0UL)          /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTENSET10_SYNC_Max (0x1UL)          /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTENSET10_SYNC_Set (0x1UL)          /*!< Enable                                                               */
  #define RADIO_INTENSET10_SYNC_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_SYNC_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* RADIO_INTENSET11: Enable interrupt */
  #define RADIO_INTENSET11_ResetValue (0x00000000UL) /*!< Reset value of INTENSET11 register.                                  */

/* PLLREADY @Bit 12 : Write '1' to enable interrupt for event PLLREADY */
  #define RADIO_INTENSET11_PLLREADY_Pos (12UL)       /*!< Position of PLLREADY field.                                          */
  #define RADIO_INTENSET11_PLLREADY_Msk (0x1UL << RADIO_INTENSET11_PLLREADY_Pos) /*!< Bit mask of PLLREADY field.              */
  #define RADIO_INTENSET11_PLLREADY_Min (0x0UL)      /*!< Min enumerator value of PLLREADY field.                              */
  #define RADIO_INTENSET11_PLLREADY_Max (0x1UL)      /*!< Max enumerator value of PLLREADY field.                              */
  #define RADIO_INTENSET11_PLLREADY_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET11_PLLREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET11_PLLREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to enable interrupt for event RXADDRESS */
  #define RADIO_INTENSET11_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENSET11_RXADDRESS_Msk (0x1UL << RADIO_INTENSET11_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENSET11_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET11_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET11_RXADDRESS_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET11_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET11_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* RADIO_INTENCLR10: Disable interrupt */
  #define RADIO_INTENCLR10_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR10 register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define RADIO_INTENCLR10_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define RADIO_INTENCLR10_READY_Msk (0x1UL << RADIO_INTENCLR10_READY_Pos) /*!< Bit mask of READY field.                       */
  #define RADIO_INTENCLR10_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTENCLR10_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTENCLR10_READY_Clear (0x1UL)       /*!< Disable                                                              */
  #define RADIO_INTENCLR10_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TXREADY @Bit 1 : Write '1' to disable interrupt for event TXREADY */
  #define RADIO_INTENCLR10_TXREADY_Pos (1UL)         /*!< Position of TXREADY field.                                           */
  #define RADIO_INTENCLR10_TXREADY_Msk (0x1UL << RADIO_INTENCLR10_TXREADY_Pos) /*!< Bit mask of TXREADY field.                 */
  #define RADIO_INTENCLR10_TXREADY_Min (0x0UL)       /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR10_TXREADY_Max (0x1UL)       /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR10_TXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_TXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_TXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

