NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* RXREADY @Bit 2 : Write '1' to disable interrupt for event RXREADY */
  #define RADIO_INTENCLR10_RXREADY_Pos (2UL)         /*!< Position of RXREADY field.                                           */
  #define RADIO_INTENCLR10_RXREADY_Msk (0x1UL << RADIO_INTENCLR10_RXREADY_Pos) /*!< Bit mask of RXREADY field.                 */
  #define RADIO_INTENCLR10_RXREADY_Min (0x0UL)       /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTENCLR10_RXREADY_Max (0x1UL)       /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTENCLR10_RXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_RXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_RXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ADDRESS @Bit 3 : Write '1' to disable interrupt for event ADDRESS */
  #define RADIO_INTENCLR10_ADDRESS_Pos (3UL)         /*!< Position of ADDRESS field.                                           */
  #define RADIO_INTENCLR10_ADDRESS_Msk (0x1UL << RADIO_INTENCLR10_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                 */
  #define RADIO_INTENCLR10_ADDRESS_Min (0x0UL)       /*!< Min enumerator value of ADDRESS field.                               */
  #define RADIO_INTENCLR10_ADDRESS_Max (0x1UL)       /*!< Max enumerator value of ADDRESS field.                               */
  #define RADIO_INTENCLR10_ADDRESS_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_ADDRESS_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_ADDRESS_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PAYLOAD @Bit 5 : Write '1' to disable interrupt for event PAYLOAD */
  #define RADIO_INTENCLR10_PAYLOAD_Pos (5UL)         /*!< Position of PAYLOAD field.                                           */
  #define RADIO_INTENCLR10_PAYLOAD_Msk (0x1UL << RADIO_INTENCLR10_PAYLOAD_Pos) /*!< Bit mask of PAYLOAD field.                 */
  #define RADIO_INTENCLR10_PAYLOAD_Min (0x0UL)       /*!< Min enumerator value of PAYLOAD field.                               */
  #define RADIO_INTENCLR10_PAYLOAD_Max (0x1UL)       /*!< Max enumerator value of PAYLOAD field.                               */
  #define RADIO_INTENCLR10_PAYLOAD_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_PAYLOAD_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_PAYLOAD_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* END @Bit 6 : Write '1' to disable interrupt for event END */
  #define RADIO_INTENCLR10_END_Pos (6UL)             /*!< Position of END field.                                               */
  #define RADIO_INTENCLR10_END_Msk (0x1UL << RADIO_INTENCLR10_END_Pos) /*!< Bit mask of END field.                             */
  #define RADIO_INTENCLR10_END_Min (0x0UL)           /*!< Min enumerator value of END field.                                   */
  #define RADIO_INTENCLR10_END_Max (0x1UL)           /*!< Max enumerator value of END field.                                   */
  #define RADIO_INTENCLR10_END_Clear (0x1UL)         /*!< Disable                                                              */
  #define RADIO_INTENCLR10_END_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_END_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PHYEND @Bit 7 : Write '1' to disable interrupt for event PHYEND */
  #define RADIO_INTENCLR10_PHYEND_Pos (7UL)          /*!< Position of PHYEND field.                                            */
  #define RADIO_INTENCLR10_PHYEND_Msk (0x1UL << RADIO_INTENCLR10_PHYEND_Pos) /*!< Bit mask of PHYEND field.                    */
  #define RADIO_INTENCLR10_PHYEND_Min (0x0UL)        /*!< Min enumerator value of PHYEND field.                                */
  #define RADIO_INTENCLR10_PHYEND_Max (0x1UL)        /*!< Max enumerator value of PHYEND field.                                */
  #define RADIO_INTENCLR10_PHYEND_Clear (0x1UL)      /*!< Disable                                                              */
  #define RADIO_INTENCLR10_PHYEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_PHYEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DISABLED @Bit 8 : Write '1' to disable interrupt for event DISABLED */
  #define RADIO_INTENCLR10_DISABLED_Pos (8UL)        /*!< Position of DISABLED field.                                          */
  #define RADIO_INTENCLR10_DISABLED_Msk (0x1UL << RADIO_INTENCLR10_DISABLED_Pos) /*!< Bit mask of DISABLED field.              */
  #define RADIO_INTENCLR10_DISABLED_Min (0x0UL)      /*!< Min enumerator value of DISABLED field.                              */
  #define RADIO_INTENCLR10_DISABLED_Max (0x1UL)      /*!< Max enumerator value of DISABLED field.                              */
  #define RADIO_INTENCLR10_DISABLED_Clear (0x1UL)    /*!< Disable                                                              */
  #define RADIO_INTENCLR10_DISABLED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_DISABLED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DEVMATCH @Bit 9 : Write '1' to disable interrupt for event DEVMATCH */
  #define RADIO_INTENCLR10_DEVMATCH_Pos (9UL)        /*!< Position of DEVMATCH field.                                          */
  #define RADIO_INTENCLR10_DEVMATCH_Msk (0x1UL << RADIO_INTENCLR10_DEVMATCH_Pos) /*!< Bit mask of DEVMATCH field.              */
  #define RADIO_INTENCLR10_DEVMATCH_Min (0x0UL)      /*!< Min enumerator value of DEVMATCH field.                              */
  #define RADIO_INTENCLR10_DEVMATCH_Max (0x1UL)      /*!< Max enumerator value of DEVMATCH field.                              */
  #define RADIO_INTENCLR10_DEVMATCH_Clear (0x1UL)    /*!< Disable                                                              */
  #define RADIO_INTENCLR10_DEVMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_DEVMATCH_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DEVMISS @Bit 10 : Write '1' to disable interrupt for event DEVMISS */
  #define RADIO_INTENCLR10_DEVMISS_Pos (10UL)        /*!< Position of DEVMISS field.                                           */
  #define RADIO_INTENCLR10_DEVMISS_Msk (0x1UL << RADIO_INTENCLR10_DEVMISS_Pos) /*!< Bit mask of DEVMISS field.                 */
  #define RADIO_INTENCLR10_DEVMISS_Min (0x0UL)       /*!< Min enumerator value of DEVMISS field.                               */
  #define RADIO_INTENCLR10_DEVMISS_Max (0x1UL)       /*!< Max enumerator value of DEVMISS field.                               */
  #define RADIO_INTENCLR10_DEVMISS_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_DEVMISS_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_DEVMISS_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CRCOK @Bit 11 : Write '1' to disable interrupt for event CRCOK */
  #define RADIO_INTENCLR10_CRCOK_Pos (11UL)          /*!< Position of CRCOK field.                                             */
  #define RADIO_INTENCLR10_CRCOK_Msk (0x1UL << RADIO_INTENCLR10_CRCOK_Pos) /*!< Bit mask of CRCOK field.                       */
  #define RADIO_INTENCLR10_CRCOK_Min (0x0UL)         /*!< Min enumerator value of CRCOK field.                                 */
  #define RADIO_INTENCLR10_CRCOK_Max (0x1UL)         /*!< Max enumerator value of CRCOK field.                                 */
  #define RADIO_INTENCLR10_CRCOK_Clear (0x1UL)       /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CRCOK_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_CRCOK_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* CRCERROR @Bit 12 : Write '1' to disable interrupt for event CRCERROR */
  #define RADIO_INTENCLR10_CRCERROR_Pos (12UL)       /*!< Position of CRCERROR field.                                          */
  #define RADIO_INTENCLR10_CRCERROR_Msk (0x1UL << RADIO_INTENCLR10_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.              */
  #define RADIO_INTENCLR10_CRCERROR_Min (0x0UL)      /*!< Min enumerator value of CRCERROR field.                              */
  #define RADIO_INTENCLR10_CRCERROR_Max (0x1UL)      /*!< Max enumerator value of CRCERROR field.                              */
  #define RADIO_INTENCLR10_CRCERROR_Clear (0x1UL)    /*!< Disable                                                              */
  #define RADIO_INTENCLR10_CRCERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_CRCERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* BCMATCH @Bit 14 : Write '1' to disable interrupt for event BCMATCH */
  #define RADIO_INTENCLR10_BCMATCH_Pos (14UL)        /*!< Position of BCMATCH field.                                           */
  #define RADIO_INTENCLR10_BCMATCH_Msk (0x1UL << RADIO_INTENCLR10_BCMATCH_Pos) /*!< Bit mask of BCMATCH field.                 */
  #define RADIO_INTENCLR10_BCMATCH_Min (0x0UL)       /*!< Min enumerator value of BCMATCH field.                               */
  #define RADIO_INTENCLR10_BCMATCH_Max (0x1UL)       /*!< Max enumerator value of BCMATCH field.                               */
  #define RADIO_INTENCLR10_BCMATCH_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_BCMATCH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_BCMATCH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SYNC @Bit 22 : Write '1' to disable interrupt for event SYNC */
  #define RADIO_INTENCLR10_SYNC_Pos (22UL)           /*!< Position of SYNC field.                                              */
  #define RADIO_INTENCLR10_SYNC_Msk (0x1UL << RADIO_INTENCLR10_SYNC_Pos) /*!< Bit mask of SYNC field.                          */
  #define RADIO_INTENCLR10_SYNC_Min (0x0UL)          /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTENCLR10_SYNC_Max (0x1UL)          /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTENCLR10_SYNC_Clear (0x1UL)        /*!< Disable                                                              */
  #define RADIO_INTENCLR10_SYNC_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_SYNC_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* RADIO_INTENCLR11: Disable interrupt */
  #define RADIO_INTENCLR11_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR11 register.                                  */

/* PLLREADY @Bit 12 : Write '1' to disable interrupt for event PLLREADY */
  #define RADIO_INTENCLR11_PLLREADY_Pos (12UL)       /*!< Position of PLLREADY field.                                          */
  #define RADIO_INTENCLR11_PLLREADY_Msk (0x1UL << RADIO_INTENCLR11_PLLREADY_Pos) /*!< Bit mask of PLLREADY field.              */
  #define RADIO_INTENCLR11_PLLREADY_Min (0x0UL)      /*!< Min enumerator value of PLLREADY field.                              */
  #define RADIO_INTENCLR11_PLLREADY_Max (0x1UL)      /*!< Max enumerator value of PLLREADY field.                              */
  #define RADIO_INTENCLR11_PLLREADY_Clear (0x1UL)    /*!< Disable                                                              */
  #define RADIO_INTENCLR11_PLLREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR11_PLLREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

