NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* RU @Bit 0 : Ramp-up time */
  #define RADIO_TIMING_RU_Pos (0UL)                  /*!< Position of RU field.                                                */
  #define RADIO_TIMING_RU_Msk (0x1UL << RADIO_TIMING_RU_Pos) /*!< Bit mask of RU field.                                        */
  #define RADIO_TIMING_RU_Min (0x0UL)                /*!< Min enumerator value of RU field.                                    */
  #define RADIO_TIMING_RU_Max (0x1UL)                /*!< Max enumerator value of RU field.                                    */
  #define RADIO_TIMING_RU_Legacy (0x0UL)             /*!< Legacy ramp-up time                                                  */
  #define RADIO_TIMING_RU_Fast (0x1UL)               /*!< Fast ramp-up (default)                                               */


/* RADIO_FREQUENCY: Frequency */
  #define RADIO_FREQUENCY_ResetValue (0x00000002UL)  /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..6 : Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz). */
  #define RADIO_FREQUENCY_FREQUENCY_Pos (0UL)        /*!< Position of FREQUENCY field.                                         */
  #define RADIO_FREQUENCY_FREQUENCY_Msk (0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.            */

/* MAP @Bit 8 : Channel map selection. 0: Channel map between 2400 MHZ to 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1:
                Channel map between 2360 MHZ to 2460 MHz, Frequency = 2360 + FREQUENCY (MHz). */

  #define RADIO_FREQUENCY_MAP_Pos (8UL)              /*!< Position of MAP field.                                               */
  #define RADIO_FREQUENCY_MAP_Msk (0x1UL << RADIO_FREQUENCY_MAP_Pos) /*!< Bit mask of MAP field.                               */


/* RADIO_TXPOWER: Output power */
  #define RADIO_TXPOWER_ResetValue (0x00000013UL)    /*!< Reset value of TXPOWER register.                                     */

/* TXPOWER @Bits 0..10 : RADIO output power */
  #define RADIO_TXPOWER_TXPOWER_Pos (0UL)            /*!< Position of TXPOWER field.                                           */
  #define RADIO_TXPOWER_TXPOWER_Msk (0x7FFUL << RADIO_TXPOWER_TXPOWER_Pos) /*!< Bit mask of TXPOWER field.                     */
  #define RADIO_TXPOWER_TXPOWER_Min (0x000UL)        /*!< Min enumerator value of TXPOWER field.                               */
  #define RADIO_TXPOWER_TXPOWER_Max (0x130UL)        /*!< Max enumerator value of TXPOWER field.                               */
  #define RADIO_TXPOWER_TXPOWER_MaxdBm (0x03FUL)     /*!< +8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos8dBm (0x03FUL)    /*!< +8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos7dBm (0x039UL)    /*!< +7 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos6dBm (0x033UL)    /*!< +6 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos5dBm (0x02DUL)    /*!< +5 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos4dBm (0x028UL)    /*!< +4 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos3dBm (0x023UL)    /*!< +3 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos2dBm (0x01FUL)    /*!< +2 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Pos1dBm (0x01BUL)    /*!< +1 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_0dBm (0x018UL)       /*!< 0 dBm                                                                */
  #define RADIO_TXPOWER_TXPOWER_Neg1dBm (0x015UL)    /*!< -1 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg2dBm (0x013UL)    /*!< -2 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg3dBm (0x011UL)    /*!< -3 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg4dBm (0x00FUL)    /*!< -4 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg5dBm (0x00DUL)    /*!< -5 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg6dBm (0x00BUL)    /*!< -6 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg7dBm (0x00AUL)    /*!< -7 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg8dBm (0x009UL)    /*!< -8 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg9dBm (0x008UL)    /*!< -9 dBm                                                               */
  #define RADIO_TXPOWER_TXPOWER_Neg10dBm (0x007UL)   /*!< -10 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg12dBm (0x006UL)   /*!< -12 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg14dBm (0x005UL)   /*!< -14 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg16dBm (0x004UL)   /*!< -16 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg18dBm (0x003UL)   /*!< -18 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg20dBm (0x002UL)   /*!< -20 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg22dBm (0x002UL)   /*!< -22 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg28dBm (0x001UL)   /*!< -28 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg40dBm (0x130UL)   /*!< -40 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_Neg46dBm (0x110UL)   /*!< -46 dBm                                                              */
  #define RADIO_TXPOWER_TXPOWER_MindBm (0x000UL)     /*!< Minimum output power                                                 */


/* RADIO_TIFS: Interframe spacing in us */
  #define RADIO_TIFS_ResetValue (0x00000000UL)       /*!< Reset value of TIFS register.                                        */

/* TIFS @Bits 0..9 : Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is
                     defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of
                     the first bit of the subsequent packet. */

  #define RADIO_TIFS_TIFS_Pos (0UL)                  /*!< Position of TIFS field.                                              */
  #define RADIO_TIFS_TIFS_Msk (0x3FFUL << RADIO_TIFS_TIFS_Pos) /*!< Bit mask of TIFS field.                                    */


