NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* RADIO_RSSISAMPLE: RSSI sample */
  #define RADIO_RSSISAMPLE_ResetValue (0x0000007FUL) /*!< Reset value of RSSISAMPLE register.                                  */

/* RSSISAMPLE @Bits 0..6 : RSSI sample result. The value of this register is read as a positive value while the actual received
                           signal strength is a negative value. Actual received signal strength is therefore as follows:
                           received signal strength = -A dBm. */

  #define RADIO_RSSISAMPLE_RSSISAMPLE_Pos (0UL)      /*!< Position of RSSISAMPLE field.                                        */
  #define RADIO_RSSISAMPLE_RSSISAMPLE_Msk (0x7FUL << RADIO_RSSISAMPLE_RSSISAMPLE_Pos) /*!< Bit mask of RSSISAMPLE field.       */


/* RADIO_FREQFINETUNE: Fine tuning of the RF frequency */
  #define RADIO_FREQFINETUNE_ResetValue (0x00000000UL) /*!< Reset value of FREQFINETUNE register.                              */

/* FREQFINETUNE @Bits 0..12 : Twos-complement number for fine-tuning the frequency. The step size is 488.28125 Hz, giving a
                              range from -1 MHz to (one step short of) +1 MHz. */

  #define RADIO_FREQFINETUNE_FREQFINETUNE_Pos (0UL)  /*!< Position of FREQFINETUNE field.                                      */
  #define RADIO_FREQFINETUNE_FREQFINETUNE_Msk (0x1FFFUL << RADIO_FREQFINETUNE_FREQFINETUNE_Pos) /*!< Bit mask of FREQFINETUNE
                                                                            field.*/


/* RADIO_FECONFIG: Config register */
  #define RADIO_FECONFIG_ResetValue (0x10800005UL)   /*!< Reset value of FECONFIG register.                                    */

/* SCALERMODE @Bit 20 : Mode for narrow scaling output. */
  #define RADIO_FECONFIG_SCALERMODE_Pos (20UL)       /*!< Position of SCALERMODE field.                                        */
  #define RADIO_FECONFIG_SCALERMODE_Msk (0x1UL << RADIO_FECONFIG_SCALERMODE_Pos) /*!< Bit mask of SCALERMODE field.            */
  #define RADIO_FECONFIG_SCALERMODE_Min (0x0UL)      /*!< Min enumerator value of SCALERMODE field.                            */
  #define RADIO_FECONFIG_SCALERMODE_Max (0x1UL)      /*!< Max enumerator value of SCALERMODE field.                            */
  #define RADIO_FECONFIG_SCALERMODE_Disabled (0x0UL) /*!< Classic log based scaling mode.                                      */
  #define RADIO_FECONFIG_SCALERMODE_Enabled (0x1UL)  /*!< LUT based scaling mode.                                              */


/* RADIO_CFO_STAT: Carrier freq. offset estimate */
  #define RADIO_CFO_STAT_ResetValue (0x00000000UL)   /*!< Reset value of CFO_STAT register.                                    */

/* SYNCOK @Bit 12 : SYNC ok */
  #define RADIO_CFO_STAT_SYNCOK_Pos (12UL)           /*!< Position of SYNCOK field.                                            */
  #define RADIO_CFO_STAT_SYNCOK_Msk (0x1UL << RADIO_CFO_STAT_SYNCOK_Pos) /*!< Bit mask of SYNCOK field.                        */
  #define RADIO_CFO_STAT_SYNCOK_Min (0x0UL)          /*!< Min enumerator value of SYNCOK field.                                */
  #define RADIO_CFO_STAT_SYNCOK_Max (0x1UL)          /*!< Max enumerator value of SYNCOK field.                                */
  #define RADIO_CFO_STAT_SYNCOK_SyncNotOK (0x0UL)    /*!< (unspecified)                                                        */
  #define RADIO_CFO_STAT_SYNCOK_SyncOk (0x1UL)       /*!< (unspecified)                                                        */


/* RADIO_DBCCORR: Correlator thresholds */
  #define RADIO_DBCCORR_ResetValue (0x1FFFFF90UL)    /*!< Reset value of DBCCORR register.                                     */

/* TH @Bits 0..7 : Correlation threshold */
  #define RADIO_DBCCORR_TH_Pos (0UL)                 /*!< Position of TH field.                                                */
  #define RADIO_DBCCORR_TH_Msk (0xFFUL << RADIO_DBCCORR_TH_Pos) /*!< Bit mask of TH field.                                     */


/* RADIO_CRCSTATUS: CRC status */
  #define RADIO_CRCSTATUS_ResetValue (0x00000000UL)  /*!< Reset value of CRCSTATUS register.                                   */

/* CRCSTATUS @Bit 0 : CRC status of packet received */
  #define RADIO_CRCSTATUS_CRCSTATUS_Pos (0UL)        /*!< Position of CRCSTATUS field.                                         */
  #define RADIO_CRCSTATUS_CRCSTATUS_Msk (0x1UL << RADIO_CRCSTATUS_CRCSTATUS_Pos) /*!< Bit mask of CRCSTATUS field.             */
  #define RADIO_CRCSTATUS_CRCSTATUS_Min (0x0UL)      /*!< Min enumerator value of CRCSTATUS field.                             */
  #define RADIO_CRCSTATUS_CRCSTATUS_Max (0x1UL)      /*!< Max enumerator value of CRCSTATUS field.                             */
  #define RADIO_CRCSTATUS_CRCSTATUS_CRCError (0x0UL) /*!< Packet received with CRC error                                       */
  #define RADIO_CRCSTATUS_CRCSTATUS_CRCOk (0x1UL)    /*!< Packet received with CRC ok                                          */


/* RADIO_RXMATCH: Received address */
  #define RADIO_RXMATCH_ResetValue (0x00000000UL)    /*!< Reset value of RXMATCH register.                                     */

/* RXMATCH @Bits 0..2 : Received address */
  #define RADIO_RXMATCH_RXMATCH_Pos (0UL)            /*!< Position of RXMATCH field.                                           */
  #define RADIO_RXMATCH_RXMATCH_Msk (0x7UL << RADIO_RXMATCH_RXMATCH_Pos) /*!< Bit mask of RXMATCH field.                       */


/* RADIO_RXCRC: CRC field of previously received packet */
  #define RADIO_RXCRC_ResetValue (0x00000000UL)      /*!< Reset value of RXCRC register.                                       */

/* RXCRC @Bits 0..23 : CRC field of previously received packet */
  #define RADIO_RXCRC_RXCRC_Pos (0UL)                /*!< Position of RXCRC field.                                             */
  #define RADIO_RXCRC_RXCRC_Msk (0xFFFFFFUL << RADIO_RXCRC_RXCRC_Pos) /*!< Bit mask of RXCRC field.                            */


/* RADIO_DAI: Device address match index */
  #define RADIO_DAI_ResetValue (0x00000000UL)        /*!< Reset value of DAI register.                                         */

/* DAI @Bits 0..2 : Device address match index */
  #define RADIO_DAI_DAI_Pos (0UL)                    /*!< Position of DAI field.                                               */
  #define RADIO_DAI_DAI_Msk (0x7UL << RADIO_DAI_DAI_Pos) /*!< Bit mask of DAI field.                                           */


/* RADIO_PDUSTAT: Payload status */
  #define RADIO_PDUSTAT_ResetValue (0x00000000UL)    /*!< Reset value of PDUSTAT register.                                     */

/* PDUSTAT @Bit 0 : Status on payload length vs. PCNF1.MAXLEN */
  #define RADIO_PDUSTAT_PDUSTAT_Pos (0UL)            /*!< Position of PDUSTAT field.                                           */
  #define RADIO_PDUSTAT_PDUSTAT_Msk (0x1UL << RADIO_PDUSTAT_PDUSTAT_Pos) /*!< Bit mask of PDUSTAT field.                       */
  #define RADIO_PDUSTAT_PDUSTAT_Min (0x0UL)          /*!< Min enumerator value of PDUSTAT field.                               */
  #define RADIO_PDUSTAT_PDUSTAT_Max (0x1UL)          /*!< Max enumerator value of PDUSTAT field.                               */
  #define RADIO_PDUSTAT_PDUSTAT_LessThan (0x0UL)     /*!< Payload less than PCNF1.MAXLEN                                       */
  #define RADIO_PDUSTAT_PDUSTAT_GreaterThan (0x1UL)  /*!< Payload greater than PCNF1.MAXLEN                                    */


/* RADIO_PCNF0: Packet configuration register 0 */
  #define RADIO_PCNF0_ResetValue (0x00000000UL)      /*!< Reset value of PCNF0 register.                                       */

/* LFLEN @Bits 0..3 : Length on air of LENGTH field in number of bits. */
  #define RADIO_PCNF0_LFLEN_Pos (0UL)                /*!< Position of LFLEN field.                                             */
  #define RADIO_PCNF0_LFLEN_Msk (0xFUL << RADIO_PCNF0_LFLEN_Pos) /*!< Bit mask of LFLEN field.                                 */

/* S0LEN @Bit 8 : Length on air of S0 field in number of bytes. */
  #define RADIO_PCNF0_S0LEN_Pos (8UL)                /*!< Position of S0LEN field.                                             */
  #define RADIO_PCNF0_S0LEN_Msk (0x1UL << RADIO_PCNF0_S0LEN_Pos) /*!< Bit mask of S0LEN field.                                 */

/* S1LEN @Bits 16..19 : Length on air of S1 field in number of bits. */
  #define RADIO_PCNF0_S1LEN_Pos (16UL)               /*!< Position of S1LEN field.                                             */
  #define RADIO_PCNF0_S1LEN_Msk (0xFUL << RADIO_PCNF0_S1LEN_Pos) /*!< Bit mask of S1LEN field.                                 */

