NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* RRAMC_ERASE_ERASEALL: Erase RRAM, including UICR */
  #define RRAMC_ERASE_ERASEALL_ResetValue (0x00000000UL) /*!< Reset value of ERASEALL register.                                */

/* ERASE @Bit 0 : Erase RRAM */
  #define RRAMC_ERASE_ERASEALL_ERASE_Pos (0UL)       /*!< Position of ERASE field.                                             */
  #define RRAMC_ERASE_ERASEALL_ERASE_Msk (0x1UL << RRAMC_ERASE_ERASEALL_ERASE_Pos) /*!< Bit mask of ERASE field.               */
  #define RRAMC_ERASE_ERASEALL_ERASE_Min (0x0UL)     /*!< Min enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_Max (0x1UL)     /*!< Max enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_NoOperation (0x0UL) /*!< No operation                                                     */
  #define RRAMC_ERASE_ERASEALL_ERASE_Erase (0x1UL)   /*!< Start erase of chip                                                  */



/* =================================================== Struct RRAMC_REGION =================================================== */
/**
  * @brief REGION [RRAMC_REGION] RRAMC can apply access privileges to regions of the RRAM. Some regions are dedicated for system
            use and are not available for configuration - refer to the instantiation table for details.

  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Region address                                        */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Region configuration                                  */
} NRF_RRAMC_REGION_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define RRAMC_REGION_MaxCount (5UL)                /*!< Size of REGION[5] array.                                             */
  #define RRAMC_REGION_MaxIndex (4UL)                /*!< Max index of REGION[5] array.                                        */
  #define RRAMC_REGION_MinIndex (0UL)                /*!< Min index of REGION[5] array.                                        */

/* RRAMC_REGION_ADDRESS: Region address */
  #define RRAMC_REGION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

/* STARTADDR @Bits 0..31 : Start address of the region [n] */
  #define RRAMC_REGION_ADDRESS_STARTADDR_Pos (0UL)   /*!< Position of STARTADDR field.                                         */
  #define RRAMC_REGION_ADDRESS_STARTADDR_Msk (0xFFFFFFFFUL << RRAMC_REGION_ADDRESS_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* RRAMC_REGION_CONFIG: Region configuration */
  #define RRAMC_REGION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                   */

/* READ @Bit 0 : Read access */
  #define RRAMC_REGION_CONFIG_READ_Pos (0UL)         /*!< Position of READ field.                                              */
  #define RRAMC_REGION_CONFIG_READ_Msk (0x1UL << RRAMC_REGION_CONFIG_READ_Pos) /*!< Bit mask of READ field.                    */
  #define RRAMC_REGION_CONFIG_READ_Min (0x0UL)       /*!< Min enumerator value of READ field.                                  */
  #define RRAMC_REGION_CONFIG_READ_Max (0x1UL)       /*!< Max enumerator value of READ field.                                  */
  #define RRAMC_REGION_CONFIG_READ_NotAllowed (0x0UL) /*!< Read access to override region [n] is not allowed                   */
  #define RRAMC_REGION_CONFIG_READ_Allowed (0x1UL)   /*!< Read access to override region [n] is allowed                        */

/* WRITE @Bit 1 : Write access */
  #define RRAMC_REGION_CONFIG_WRITE_Pos (1UL)        /*!< Position of WRITE field.                                             */
  #define RRAMC_REGION_CONFIG_WRITE_Msk (0x1UL << RRAMC_REGION_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                 */
  #define RRAMC_REGION_CONFIG_WRITE_Min (0x0UL)      /*!< Min enumerator value of WRITE field.                                 */
  #define RRAMC_REGION_CONFIG_WRITE_Max (0x1UL)      /*!< Max enumerator value of WRITE field.                                 */
  #define RRAMC_REGION_CONFIG_WRITE_NotAllowed (0x0UL) /*!< Write access to override region [n] is not allowed                 */
  #define RRAMC_REGION_CONFIG_WRITE_Allowed (0x1UL)  /*!< Write access to override region [n] is allowed                       */

/* EXECUTE @Bit 2 : Execute access */
  #define RRAMC_REGION_CONFIG_EXECUTE_Pos (2UL)      /*!< Position of EXECUTE field.                                           */
  #define RRAMC_REGION_CONFIG_EXECUTE_Msk (0x1UL << RRAMC_REGION_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.           */
  #define RRAMC_REGION_CONFIG_EXECUTE_Min (0x0UL)    /*!< Min enumerator value of EXECUTE field.                               */
  #define RRAMC_REGION_CONFIG_EXECUTE_Max (0x1UL)    /*!< Max enumerator value of EXECUTE field.                               */
  #define RRAMC_REGION_CONFIG_EXECUTE_NotAllowed (0x0UL) /*!< Execute access to override region [n] is not allowed             */
  #define RRAMC_REGION_CONFIG_EXECUTE_Allowed (0x1UL) /*!< Execute access to override region [n] is allowed                    */

/* WRITEONCE @Bit 12 : Write-once */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Pos (12UL)   /*!< Position of WRITEONCE field.                                         */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Msk (0x1UL << RRAMC_REGION_CONFIG_WRITEONCE_Pos) /*!< Bit mask of WRITEONCE field.     */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Min (0x0UL)  /*!< Min enumerator value of WRITEONCE field.                             */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Max (0x1UL)  /*!< Max enumerator value of WRITEONCE field.                             */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Disabled (0x0UL) /*!< Write-once disabled                                              */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Enabled (0x1UL) /*!< Write-once enabled                                                */

/* LOCK @Bit 13 : Enable lock */
  #define RRAMC_REGION_CONFIG_LOCK_Pos (13UL)        /*!< Position of LOCK field.                                              */
  #define RRAMC_REGION_CONFIG_LOCK_Msk (0x1UL << RRAMC_REGION_CONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define RRAMC_REGION_CONFIG_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define RRAMC_REGION_CONFIG_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define RRAMC_REGION_CONFIG_LOCK_Disabled (0x0UL)  /*!< Lock disabled for region [n]                                         */
  #define RRAMC_REGION_CONFIG_LOCK_Enabled (0x1UL)   /*!< Lock enabled for region [n]                                          */

/* SIZE @Bits 16..25 : Size in KBytes of region [n] */
  #define RRAMC_REGION_CONFIG_SIZE_Pos (16UL)        /*!< Position of SIZE field.                                              */
  #define RRAMC_REGION_CONFIG_SIZE_Msk (0x3FFUL << RRAMC_REGION_CONFIG_SIZE_Pos) /*!< Bit mask of SIZE field.                  */


