NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* WRITEPROTECTION @Bits 4..7 : The write protection must be cleared to allow updates to the VALUE field. */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Pos (4UL) /*!< Position of WRITEPROTECTION field.                        */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Msk (0xFUL << TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Pos) /*!< Bit
                                                                            mask of WRITEPROTECTION field.*/
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Min (0x0UL) /*!< Min enumerator value of WRITEPROTECTION field.          */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Max (0xFUL) /*!< Max enumerator value of WRITEPROTECTION field.          */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Disabled (0x0UL) /*!< Read: Write protection is disabled.                */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Enabled (0x1UL) /*!< Read: Write protection is enabled.                  */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_WRITEPROTECTION_Clear (0xFUL) /*!< Write: Value to clear write protection.               */

/* KEY @Bits 16..31 : Required write key for upper 16 bits. Must be included in all register write operations. */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_KEY_Pos (16UL) /*!< Position of KEY field.                                               */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_KEY_Msk (0xFFFFUL << TAMPC_PROTECT_AP_DBGEN_CTRL_KEY_Pos) /*!< Bit mask of KEY field.    */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_KEY_Min (0x50FAUL) /*!< Min enumerator value of KEY field.                               */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_KEY_Max (0x50FAUL) /*!< Max enumerator value of KEY field.                               */
  #define TAMPC_PROTECT_AP_DBGEN_CTRL_KEY_KEY (0x50FAUL) /*!< Write key value.                                                 */


/* TAMPC_PROTECT_AP_DBGEN_STATUS: Status register for invasive (halting) debug enable for domain ns access port. */
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                         */

/* ERROR @Bit 0 : Error detection status. */
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_Pos (0UL) /*!< Position of ERROR field.                                          */
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_Msk (0x1UL << TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_Pos) /*!< Bit mask of ERROR
                                                                            field.*/
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_Min (0x0UL) /*!< Min enumerator value of ERROR field.                            */
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_Max (0x1UL) /*!< Max enumerator value of ERROR field.                            */
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_NoError (0x0UL) /*!< No error detected.                                          */
  #define TAMPC_PROTECT_AP_DBGEN_STATUS_ERROR_Error (0x1UL) /*!< Error detected.                                               */



/* ================================================= Struct TAMPC_PROTECT_AP ================================================= */
/**
  * @brief AP [TAMPC_PROTECT_AP] (unspecified)
  */
typedef struct {
  __IOM NRF_TAMPC_PROTECT_AP_DBGEN_Type DBGEN;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED[2];
} NRF_TAMPC_PROTECT_AP_Type;                         /*!< Size = 16 (0x010)                                                    */
  #define TAMPC_PROTECT_AP_MaxCount (1UL)            /*!< Size of AP[1] array.                                                 */
  #define TAMPC_PROTECT_AP_MaxIndex (0UL)            /*!< Max index of AP[1] array.                                            */
  #define TAMPC_PROTECT_AP_MinIndex (0UL)            /*!< Min index of AP[1] array.                                            */


/* ============================================== Struct TAMPC_PROTECT_GPIOSWD =============================================== */
/**
  * @brief GPIOSWD [TAMPC_PROTECT_GPIOSWD] Enable GPIO functionality on SWD pins.
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Control register for activating GPIO functionality.   */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register for active shield detector enable
                                                                         signal.*/
} NRF_TAMPC_PROTECT_GPIOSWD_Type;                    /*!< Size = 8 (0x008)                                                     */

/* TAMPC_PROTECT_GPIOSWD_CTRL: Control register for activating GPIO functionality. */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_ResetValue (0x00000010UL) /*!< Reset value of CTRL register.                              */

/* VALUE @Bit 0 : Activate GPIO functionality. */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_Msk (0x1UL << TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_Pos) /*!< Bit mask of VALUE field.   */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_Min (0x0UL) /*!< Min enumerator value of VALUE field.                               */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_Max (0x1UL) /*!< Max enumerator value of VALUE field.                               */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_Low (0x0UL) /*!< SWD pins have SWD functionality.                                   */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_VALUE_High (0x1UL) /*!< SWD pins are re-purposed as GPIO pins.                            */

/* LOCK @Bit 1 : Lock this register to prevent changes to the VALUE field until next reset. */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Pos (1UL)  /*!< Position of LOCK field.                                              */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Msk (0x1UL << TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Disabled (0x0UL) /*!< Lock disabled.                                                 */
  #define TAMPC_PROTECT_GPIOSWD_CTRL_LOCK_Enabled (0x1UL) /*!< Lock enabled.                                                   */

