NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* TWIM_TASKS_DMA_RX_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define TWIM_TASKS_DMA_RX_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define TWIM_TASKS_DMA_RX_START_START_Pos (0UL)    /*!< Position of START field.                                             */
  #define TWIM_TASKS_DMA_RX_START_START_Msk (0x1UL << TWIM_TASKS_DMA_RX_START_START_Pos) /*!< Bit mask of START field.         */
  #define TWIM_TASKS_DMA_RX_START_START_Min (0x1UL)  /*!< Min enumerator value of START field.                                 */
  #define TWIM_TASKS_DMA_RX_START_START_Max (0x1UL)  /*!< Max enumerator value of START field.                                 */
  #define TWIM_TASKS_DMA_RX_START_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* TWIM_TASKS_DMA_RX_STOP: Stops operation using easyDMA. This does not trigger an END event. */
  #define TWIM_TASKS_DMA_RX_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                  */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. */
  #define TWIM_TASKS_DMA_RX_STOP_STOP_Pos (0UL)      /*!< Position of STOP field.                                              */
  #define TWIM_TASKS_DMA_RX_STOP_STOP_Msk (0x1UL << TWIM_TASKS_DMA_RX_STOP_STOP_Pos) /*!< Bit mask of STOP field.              */
  #define TWIM_TASKS_DMA_RX_STOP_STOP_Min (0x1UL)    /*!< Min enumerator value of STOP field.                                  */
  #define TWIM_TASKS_DMA_RX_STOP_STOP_Max (0x1UL)    /*!< Max enumerator value of STOP field.                                  */
  #define TWIM_TASKS_DMA_RX_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TWIM_TASKS_DMA_RX_ENABLEMATCH: Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_MaxCount (4UL) /*!< Max size of ENABLEMATCH[4] array.                                  */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_MaxIndex (3UL) /*!< Max index of ENABLEMATCH[4] array.                                 */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_MinIndex (0UL) /*!< Min index of ENABLEMATCH[4] array.                                 */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_ResetValue (0x00000000UL) /*!< Reset value of ENABLEMATCH[4] register.                 */

/* ENABLEMATCH @Bit 0 : Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos (0UL) /*!< Position of ENABLEMATCH field.                              */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Msk (0x1UL << TWIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos) /*!< Bit mask
                                                                            of ENABLEMATCH field.*/
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Min (0x1UL) /*!< Min enumerator value of ENABLEMATCH field.                */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Max (0x1UL) /*!< Max enumerator value of ENABLEMATCH field.                */
  #define TWIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Trigger (0x1UL) /*!< Trigger task                                          */


/* TWIM_TASKS_DMA_RX_DISABLEMATCH: Disables the MATCH[n] event by clearing the ENABLE[n] bit in the CONFIG register. */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_MaxCount (4UL) /*!< Max size of DISABLEMATCH[4] array.                                */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_MaxIndex (3UL) /*!< Max index of DISABLEMATCH[4] array.                               */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_MinIndex (0UL) /*!< Min index of DISABLEMATCH[4] array.                               */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_ResetValue (0x00000000UL) /*!< Reset value of DISABLEMATCH[4] register.               */

/* DISABLEMATCH @Bit 0 : Disables the MATCH[n] event by clearing the ENABLE[n] bit in the CONFIG register. */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_DISABLEMATCH_Pos (0UL) /*!< Position of DISABLEMATCH field.                           */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_DISABLEMATCH_Msk (0x1UL << TWIM_TASKS_DMA_RX_DISABLEMATCH_DISABLEMATCH_Pos) /*!< Bit
                                                                            mask of DISABLEMATCH field.*/
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_DISABLEMATCH_Min (0x1UL) /*!< Min enumerator value of DISABLEMATCH field.             */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_DISABLEMATCH_Max (0x1UL) /*!< Max enumerator value of DISABLEMATCH field.             */
  #define TWIM_TASKS_DMA_RX_DISABLEMATCH_DISABLEMATCH_Trigger (0x1UL) /*!< Trigger task                                        */



/* ================================================ Struct TWIM_TASKS_DMA_TX ================================================= */
/**
  * @brief TX [TWIM_TASKS_DMA_TX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event.*/
} NRF_TWIM_TASKS_DMA_TX_Type;                        /*!< Size = 8 (0x008)                                                     */

/* TWIM_TASKS_DMA_TX_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define TWIM_TASKS_DMA_TX_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define TWIM_TASKS_DMA_TX_START_START_Pos (0UL)    /*!< Position of START field.                                             */
  #define TWIM_TASKS_DMA_TX_START_START_Msk (0x1UL << TWIM_TASKS_DMA_TX_START_START_Pos) /*!< Bit mask of START field.         */
  #define TWIM_TASKS_DMA_TX_START_START_Min (0x1UL)  /*!< Min enumerator value of START field.                                 */
  #define TWIM_TASKS_DMA_TX_START_START_Max (0x1UL)  /*!< Max enumerator value of START field.                                 */
  #define TWIM_TASKS_DMA_TX_START_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* TWIM_TASKS_DMA_TX_STOP: Stops operation using easyDMA. This does not trigger an END event. */
  #define TWIM_TASKS_DMA_TX_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                  */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. */
  #define TWIM_TASKS_DMA_TX_STOP_STOP_Pos (0UL)      /*!< Position of STOP field.                                              */
  #define TWIM_TASKS_DMA_TX_STOP_STOP_Msk (0x1UL << TWIM_TASKS_DMA_TX_STOP_STOP_Pos) /*!< Bit mask of STOP field.              */
  #define TWIM_TASKS_DMA_TX_STOP_STOP_Min (0x1UL)    /*!< Min enumerator value of STOP field.                                  */
  #define TWIM_TASKS_DMA_TX_STOP_STOP_Max (0x1UL)    /*!< Max enumerator value of STOP field.                                  */
  #define TWIM_TASKS_DMA_TX_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */



/* ================================================== Struct TWIM_TASKS_DMA ================================================== */
/**
  * @brief TASKS_DMA [TWIM_TASKS_DMA] Peripheral tasks.
  */
typedef struct {
  __OM  NRF_TWIM_TASKS_DMA_RX_Type RX;               /*!< (@ 0x00000000) Peripheral tasks.                                     */
  __OM  NRF_TWIM_TASKS_DMA_TX_Type TX;               /*!< (@ 0x00000028) Peripheral tasks.                                     */
} NRF_TWIM_TASKS_DMA_Type;                           /*!< Size = 48 (0x030)                                                    */


