NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_types.h
/* STATUS @Bits 0..31 : Revocation status. */
  #define UICR_USER_ROT_PUBKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                          */
  #define UICR_USER_ROT_PUBKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << UICR_USER_ROT_PUBKEY_REVOKE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/
  #define UICR_USER_ROT_PUBKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                     */
  #define UICR_USER_ROT_PUBKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                     */
  #define UICR_USER_ROT_PUBKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                                   */



/* ============================================= Struct UICR_USER_ROT_AUTHOPKEY ============================================== */
/**
  * @brief AUTHOPKEY [UICR_USER_ROT_AUTHOPKEY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIGEST[8];                         /*!< (@ 0x00000000) First 256 bits of SHA2-512 digest over RoT
                                                                         authenticated operation public key generation [n].*/
  __IOM uint32_t  REVOKE[3];                         /*!< (@ 0x00000020) Revocation status for RoT authenticated operation
                                                                         public key generation [n].*/
} NRF_UICR_USER_ROT_AUTHOPKEY_Type;                  /*!< Size = 44 (0x02C)                                                    */
  #define UICR_USER_ROT_AUTHOPKEY_MaxCount (4UL)     /*!< Size of AUTHOPKEY[4] array.                                          */
  #define UICR_USER_ROT_AUTHOPKEY_MaxIndex (3UL)     /*!< Max index of AUTHOPKEY[4] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_MinIndex (0UL)     /*!< Min index of AUTHOPKEY[4] array.                                     */

/* UICR_USER_ROT_AUTHOPKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].
                                    */

  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                      */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MaxIndex (7UL) /*!< Max index of DIGEST[8] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[8] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                     */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* UICR_USER_ROT_AUTHOPKEY_REVOKE: Revocation status for RoT authenticated operation public key generation [n]. */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                      */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MaxIndex (2UL) /*!< Max index of REVOKE[3] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[3] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                     */

/* STATUS @Bits 0..31 : Revocation status. */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                       */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                  */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                  */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                                */



/* ================================================== Struct UICR_USER_ROT =================================================== */
/**
  * @brief ROT [UICR_USER_ROT] Assets installed to establish initial Root of Trust in the device.
  */
typedef struct {
  __IOM NRF_UICR_USER_ROT_PUBKEY_Type PUBKEY[4];     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UICR_USER_ROT_AUTHOPKEY_Type AUTHOPKEY[4]; /*!< (@ 0x000000B0) (unspecified)                                       */
} NRF_UICR_USER_ROT_Type;                            /*!< Size = 352 (0x160)                                                   */


/* ==================================================== Struct UICR_USER ===================================================== */
/**
  * @brief USER [UICR_USER] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_USER_ROT_Type ROT;                  /*!< (@ 0x00000000) Assets installed to establish initial Root of Trust in
                                                                         the device.*/
} NRF_UICR_USER_Type;                                /*!< Size = 352 (0x160)                                                   */

/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User Information Configuration Registers
  */
  typedef struct {                                   /*!< UICR Structure                                                       */
    __IOM NRF_UICR_APPROTECT_Type APPROTECT[1];      /*!< (@ 0x00000000) Access Port Protection Registers                      */
    __IM uint32_t RESERVED[20];
    __IOM NRF_UICR_ERASEPROTECT_Type ERASEPROTECT[1]; /*!< (@ 0x00000060) Erase Protection Registers                           */
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t BOOTCONF;                         /*!< (@ 0x00000080) Immutable boot region configuration.                  */
    __IM uint32_t RESERVED2[95];
    __IOM NRF_UICR_USER_Type USER;                   /*!< (@ 0x00000200) (unspecified)                                         */
    __IM uint32_t RESERVED3[104];
    __IOM uint32_t OTP[320];                         /*!< (@ 0x00000500) One time programmable memory                          */
  } NRF_UICR_Type;                                   /*!< Size = 2560 (0xA00)                                                  */

